33866
855
657
198
40
70
855
352
198
40
86
855
362
198
37048
855
513
198
41
48
855
604
198
41
70
855
642
198
41
86
855
718
198
25123
855
767
198
42
48
855
807
198
42
70
855
860
198
42
86
855
838
198
13534
855
1367
198
43
48
855
1105
198
43
70
855
1511
198
43
86
855
1478
198
5673
855
1315
198
49215
855
1467
198
44
70
855
1596
198
44
86
855
1248
198
4535
855
678
198
45
48
855
1160
198
45
70
855
2310
198
45
86
855
2534
198
23621
855
2242
198
46
48
855
1987
198
46
70
855
1679
198
46
86
855
2608
198
4537
855
2681
198
47
48
855
2579
198
31743
855
2808
198
47
86
855
1542
198
48
32
855
3261
198
48
48
855
3933
198
48
70
855
4747
198
48
86
855
4974
198
3861
855
3439
198
49
48
855
4570
198
49
70
855
5214
198
49
86
855
4353
198
4090
855
5014
198
50
48
855
2319
198
50
70
855
6073
198
10462
855
5433
198
5603
855
5946
198
51
48
855
5846
198
51
70
855
4153
198
5080
855
6337
198
34970
855
6298
198
52
48
855
4764
198
52
70
855
5125
198
52
86
855
2026
198
11731
855
6885
198
53
48
855
6740
198
53
70
855
7192
198
53
86
855
7175
198
15543
855
5996
198
54
48
855
7265
198
54
70
855
7632
198
54
86
855
7618
198
55
32
855
7863
198
55
48
855
3126
198
55
70
855
8454
198
55
86
855
8190
198
44947
855
8093
198
56
48
855
5598
198
56
70
855
6135
198
56
86
855
7930
198
34892
855
8275
198
57
48
855
8257
198
57
70
855
8644
198
57
86
855
4317
198
64
32
855
9166
198
64
48
855
7724
198
363
855
8854
198
707
855
8915
198
65
32
855
5441
198
65
48
855
8684
198
35904
855
8541
198
65
86
855
8699
198
66
32
855
9225
198
66
48
855
4019
198
66
70
855
9773
198
66
86
855
9415
198
67
32
855
9698
198
67
48
855
9508
198
67
70
855
7600
198
67
86
855
9849
198
68
32
855
10083
198
68
48
855
9193
198
1533
855
9919
198
413
855
4101
198
69
32
855
10495
198
69
48
855
10190
198
40616
855
10261
198
78
48
855
10048
198
519
855
6957
198
322
855
9907
198
79
32
855
10111
198
79
48
855
9661
198
6024
855
7388
198
79
86
855
1802
198
80
32
855
8949
198
80
48
855
15143
198
80
70
855
15349
198
80
86
855
14436
198
81
32
855
13343
198
41345
855
15696
198
31653
855
16226
198
82
32
855
15495
198
82
48
855
16003
198
45213
855
9796
198
2032
855
13374
198
83
32
855
13539
198
83
48
855
17318
198
25297
855
17342
198
4246
855
12279
198
84
32
855
18693
198
84
48
855
19048
198
1018
855
19035
198
84
86
855
15136
198
85
32
855
7982
198
85
48
855
20416
198
45119
855
19409
198
85
86
855
17031
198
86
32
855
19755
198
86
48
855
13151
198
86
70
855
19710
198
1383
855
18112
198
87
32
855
13108
198
87
48
855
20248
198
87
70
855
11323
198
87
86
855
23134
198
88
32
855
21761
198
88
48
855
22169
198
35641
855
22352
198
88
86
855
17501
198
89
32
855
21056
198
89
48
855
21643
198
89
70
855
21503
198
89
86
855
23666
198
15
32
855
12713
198
15
48
855
25500
198
15
70
855
25181
198
15
86
855
24356
198
16
32
855
20224
198
16
48
855
20299
198
16
70
855
22986
198
16
86
855
22909
198
17
32
855
22613
198
17
48
855
24041
198
17
70
855
6640
198
17
86
855
25326
198
18
32
855
24848
198
18
48
855
24652
198
18
70
855
24235
198
18
86
855
20708
198
19
32
855
23871
198
19
48
855
23313
198
19
70
855
24063
198
19
86
855
26422
198
20
32
855
13454
198
20
48
855
27829
198
20
70
855
25090
198
20
86
855
26826
198
21
32
855
25307
198
21
48
855
21409
198
21
70
855
26753
198
21
86
855
26118
198
22
32
855
23378
198
22
48
855
27191
198
22
70
855
16677
198
22
86
855
28369
198
23
32
855
23120
198
23
48
855
28174
198
23
70
855
27621
198
23
86
855
19038
198
24
32
855
26937
198
24
48
855
26607
198
24
70
855
27368
198
24
86
855
27228
198
10
32
855
11546
198
10
48
855
30110
198
10
70
855
28581
198
10
86
855
28551
198
14
32
855
28598
198
14
48
855
22855
198
14
70
855
28481
198
14
86
855
27649
198
3838
855
27778
198
32
48
855
27230
198
10262
855
19884
198
23155
855
31009
198
4339
855
17817
198
33
48
855
29691
198
33
70
855
30483
198
33
86
855
24793
198
8141
855
28817
198
34
48
855
29903
198
34
70
855
2757
198
34
86
855
1594
198
5631
855
939
198
35
48
855
580
198
35
70
855
22131
198
35
86
855
27408
198
16412
855
26956
198
36
48
855
22538
198
36
70
855
27253
198
36
86
855
27791
198
7708
855
27121
198
37
48
855
28815
198
37
70
855
20064
198
37
86
855
28714
198
9273
855
23679
198
38
48
855
28658
198
38
70
855
28277
198
38
86
855
22951
198
7801
855
26881
198
41275
855
24894
198
39
70
855
29217
198
39
86
855
30453
198
3539
855
15629
198
44482
855
31566
198
70
32
855
27795
198
70
48
855
30299
198
1130
855
26063
198
70
86
855
18500
198
71
32
855
31510
198
71
48
855
30989
198
71
70
855
29041
198
36599
855
31064
198
72
32
855
18395
198
72
48
855
34598
198
328
855
31773
198
14246
855
30435
198
73
32
855
34323
198
73
48
855
28878
198
73
70
855
34044
198
73
86
855
34385
198
74
32
855
32544
198
74
48
855
32817
198
10025
855
14956
198
46265
855
35150
198
75
32
855
34353
198
75
48
855
35989
198
75
70
855
35264
198
75
86
855
29637
198
42646
855
34951
198
76
48
855
30179
198
11296
855
32996
198
76
86
855
34620
198
77
32
855
8646
198
77
48
855
34489
198
782
855
25264
198
47516
855
32056
198
78
32
855
35360
198
81
48
855
14280
198
40
41275
28
17759
198
3528
36
28
36100
198
64
38022
28
37528
198
64
54
19
28
37831
198
11215
52
28
21148
198
65
1731
28
39166
198
40
39
15450
57
48
855
35404
198
40692
40
28
39135
198
40
36905
28
32158
198
56
55
48
28
32090
198
40
39
66
28
37737
198
3528
23
28
37364
198
57
54
19
28
36678
198
3528
44
28
38249
198
64
55
48
28
20479
198
64
37643
28
33797
198
56
54
19
28
38107
198
65
18
40
28
38549
198
57
37643
28
39768
198
3528
40
28
25829
198
57
54
48
28
38147
198
3528
56
28
38703
198
64
54
20
77
39174
198
40
7801
28
39466
198
65
18
52
28
21355
198
3528
41133
39882
198
56
54
86
28
41810
198
56
55
40
28
42032
198
40
17184
85
40654
198
3528
15
28
33015
198
3528
24
76
39697
198
3528
2290
38721
198
3528
48
28
35419
198
3528
70
28
38902
198
3528
41133
34892
855
26481
198
64
22117
28
43336
198
56
37643
28
41569
198
65
38022
28
37224
198
40
39
15450
41235
198
64
54
24
84
34772
198
65
1238
28
41922
198
65
38
86
28
41103
198
57
54
1120
37576
198
3528
19
28
31011
198
3528
86
28
5867
198
66
18
48
28
25643
198
40
39
41
75
32591
198
36020
52
28
30727
198
3528
52
28
31672
198
11215
23
28
32747
198
65
39
74
28
37255
198
3528
41
75
38369
198
3528
66
28
35617
198
5064
48
28
40286
198
56
18
48
28
28947
198
5064
44
28
35592
198
64
54
48
28
34465
198
65
18
48
28
35897
198
10008
74
28
34085
198
67
55
48
28
32647
198
40692
48
28
34131
198
40
6500
28
37563
198
3528
75
89
39320
198
3528
24
84
40385
198
64
54
15
28
20959
198
56
54
15
28
39595
198
65
18
66
28
38831
198
56
55
74
28
38446
198
56
54
48
28
38595
198
66
17
52
28
29524
198
40
39
15450
56
55
48
28
40660
198
40
3620
28
36203
198
64
54
66
28
39093
198
3528
57
28435
70
855
42141
198
56
22117
28
25508
198
40
39
74
28
43722
198
36020
53
88
41423
198
67
55
40
28
23460
198
40
39
52
28
42819
198
65
38
48
28
37144
198
40
39
45
15
38867
198
10008
15
28
42294
198
41
18
44
28
40736
198
3528
18519
42489
198
3528
75
15
28560
198
56
55
49
40842
1731
28
43155
198
64
55
15450
44341
198
64
55
40
28
37290
198
56
17
52
28
43686
198
40
39
6780
67
48
855
39937
198
64
54
86
28
44729
198
10008
40
28
43292
198
40
39
4598
44084
198
65
17
86
28
44367
198
19071
28
13803
198
40
39
26059
67
38
70
28
44417
198
14114
28
44063
198
67
37094
88
47567
198
56
17
70
28
46752
198
3528
37
89
36561
198
40
39
25404
44552
198
2149
70
28
45210
198
20475
48
28
41761
198
64
54
34223
41934
198
10008
48
28
11470
198
64
54
56
28
47744
198
2389
40
28
4570
17
198
56
54
66
28
49327
198
40692
41
89
44969
198
64
17
52
28
21268
198
2149
40
28
44856
198
10008
70
28
40884
198
57
54
15
28
43019
198
16284
85
35904
855
45620
198
5064
66
28
28687
198
5064
40
28
47343
198
64
37094
88
46633
198
40
39
34985
66
86
855
47946
198
40
25374
28
49020
198
65
17
48
28
29414
198
10008
56
28
44622
198
67
54
86
28
42163
198
56
55
49
75
45473
198
3528
37
15
45937
198
11215
74
28
29101
198
66
7801
28
4353
16
198
65
18
41
75
4353
17
198
5064
15450
57
48
855
49814
198
40
39
45
75
40400
198
67
37643
28
44826
198
40
39
3886
65
86
855
48340
198
3528
12337
49689
198
67
54
15
28
43550
198
3528
37
88
57
48
855
49633
198
3528
49
75
33882
198
56
54
2290
5014
16
198
56
54
20
74
48207
198
3528
24
88
5014
18
198
64
54
4598
5014
19
198
40692
45
15
42321
198
64
55
45
15
48758
198
56
36326
28
5014
22
198
11215
24
83
39260
198
10008
19
28
43927
198
67
38
70
28
7337
198
16284
85
65
48
855
22219
198
10008
66
28
42622
198
67
54
19
28
38210
198
65
18
32
28
32320
198
44
5631
28
36966
198
10008
86
28
45439
198
3528
20
20306
32
855
41879
198
40692
45
89
41247
198
3528
53
19
48132
198
40
42598
28
32921
198
11215
53
89
43184
198
10008
52
28
42215
198
40692
66
28
46618
198
64
55
49
20
45900
198
56
54
1120
40643
198
3528
41
20
38158
198
57
54
86
28
47580
198
65
18
44
28
45959
198
65
18
41
15
48475
198
65
17
44
28
28262
198
66
55
52
28
49294
198
3528
57
88
65
1238
28
46588
198
3528
12337
36020
52
28
49125
198
40
39
45
16
48252
198
64
55
57
75
36959
198
65
18
23266
34892
855
48065
198
40
39
2949
45345
198
40
17184
12162
37643
28
45063
198
9374
48
28
42313
198
11215
36
28
35090
198
66
38022
28
604
3132
198
64
54
67
375
32
855
46393
198
56
55
41
15
47407
198
65
54
53
463
32
855
604
2682
198
3528
42388
42671
198
67
55
45
15
50038
198
57
54
20
74
604
2718
198
6561
15
28
604
2548
198
56
54
34223
604
2670
198
10008
23
28
33879
198
56
29767
81
604
3901
198
3528
2949
604
3682
198
3528
87
75
40384
198
64
54
53
89
45095
198
11215
53
74
48655
198
56
55
41
74
604
3510
198
19
78
32
28
604
2857
198
65
18
53
15
49989
198
10008
78
28
604
2920
198
3528
10547
18523
198
57
48397
88
49356
198
64
34278
28
4153
17
198
56
54
87
325
48
855
4153
18
198
65
18
53
88
604
4051
198
65
18
45
15
46839
198
57
17
70
28
604
3980
198
66
41275
28
47996
198
40
32886
82
50154
198
56
55
45
15
604
3270
198
16284
71
35904
855
34091
198
56
46456
28
604
5333
198
65
2481
75
604
5237
198
67
54
48
28
604
5066
198
43490
18519
604
2414
198
3528
71
14751
86
855
49669
198
3528
49
85
604
2791
198
3528
67
85
604
3134
198
3528
12337
66
86
855
604
3104
198
57
17
52
28
604
3388
198
41
18
48
28
38634
198
5064
52
28
604
4869
198
11215
6420
604
4761
198
40
39
45
71
604
4790
198
3528
78
28
604
4524
198
3528
41
16
67
32
855
45881
198
40
39
67
28435
70
855
604
4304
198
3528
37
36299
32
855
604
3324
198
57
29767
15
604
3695
198
3528
82
28
604
3720
198
56
54
16
75
23487
198
40
39
26059
65
38
86
28
4764
16
198
65
17
82
28
4764
17
198
40
39
4598
57
48
855
4764
18
198
40
39
15450
40692
74
28
4764
19
198
64
18564
75
4764
20
198
44
7206
28
604
4521
198
57
76
56
28
4764
22
198
64
54
2949
604
3459
198
66
38
86
28
604
4531
198
67
38
18519
66
70
855
45601
198
40
17184
88
5125
16
198
32304
19
28
5125
17
198
3528
75
463
32
855
5125
18
198
64
54
52
28
5125
19
198
67
55
41
75
604
3865
198
56
54
25404
604
4846
198
3528
20
75
5125
22
198
64
54
42388
604
4089
198
56
55
32
28
48391
198
64
54
20
75
5323
198
64
29767
75
24555
198
3528
16
75
47233
198
3528
6420
67
32
855
44541
198
56
54
20
89
41612
198
65
1495
75
43367
198
65
1495
77
2026
21
198
64
54
24
1229
86
855
2026
22
198
40
39
67
672
86
855
2026
23
198
10008
82
28
2026
24
198
40
39
53
86
35148
198
40
39
15450
57
54
306
642
1157
198
3528
37
74
22243
198
2389
44
28
642
1485
198
40
39
53
89
642
1415
198
56
55
49
75
34892
855
642
1314
198
65
18
53
89
642
1433
198
3528
16
85
11215
52
28
642
1558
198
67
54
52
28
642
1507
198
65
17
66
28
642
1129
198
5064
45
15
36141
198
64
54
20
74
642
2481
198
64
54
28781
642
1828
198
40
39
45
85
642
1954
198
64
54
16
75
642
1731
198
66
37094
88
45719
198
32304
40
28
642
2075
198
56
76
53
88
642
1983
198
64
55
78
28
642
2078
198
56
29767
15
49888
198
3528
24
84
57
48
855
40585
198
40
39
45
3099
54
48
28
642
3132
198
2149
15
28
642
2624
198
56
55
41
75
642
2091
198
40
39
6780
67
55
40
28
642
2682
198
56
17
44
28
642
2327
198
5064
15450
642
2623
198
16284
82
642
2718
198
40692
32
28
642
2548
198
56
54
28781
642
2670
198
56
54
49044
57
48
855
38190
198
64
55
32
28
642
3901
198
16284
85
9374
48
28
642
3682
198
40
39
4598
64
54
2949
642
3559
198
64
8845
28
642
2598
198
3528
2528
642
2231
198
3528
37
571
18
53
15
642
3510
198
40
39
25404
11215
52
28
642
2857
198
36020
53
5948
48
855
642
2780
198
67
36326
28
642
2920
198
3528
12337
34892
855
25240
198
3528
53
84
642
4349
198
16284
85
65
55
32
28
642
4309
198
5639
40
28
642
4310
198
10008
2290
642
4051
198
40
39
53
84
44717
198
3528
37
77
642
3980
198
64
55
41
75
642
3553
198
56
29767
75
642
3365
198
56
55
52
28
642
3270
198
56
55
41
20
38089
198
40
39
67
20306
54
87
74
642
5333
198
56
55
45
89
642
5237
198
31522
74
28
642
5066
198
9399
25123
642
2414
198
56
17
86
28
642
2996
198
65
1959
81
642
2791
198
40692
41
75
642
3134
198
66
2078
28
642
3104
198
5064
56
28
642
3388
198
64
54
646
44626
198
64
36326
28
642
4869
198
3528
24
76
57
70
855
642
4761
198
40
17184
75
642
4790
198
36020
53
84
642
4524
198
5064
74
28
642
2425
198
64
54
87
75
642
4304
198
65
18
45
75
642
3324
198
64
55
49
75
642
3695
198
65
18
41
83
642
3720
198
2389
40
86
49215
855
41234
198
40
39
41
44601
86
855
642
6659
198
3528
16
71
35904
855
642
6469
198
40
39
3629
66
70
855
642
5999
198
3528
3829
64
37094
88
642
5705
198
65
18
41
74
642
5332
198
67
54
87
15
642
4521
198
3528
41
75
57
54
19
28
642
5774
198
3528
87
8957
17
52
28
642
3459
198
56
55
45
75
642
4531
198
56
54
20
73
57
48
855
642
3829
198
64
18
44
28
642
6420
198
56
55
75
89
642
5892
198
65
18
646
642
6052
198
57
54
20
73
57
48
855
642
5824
198
3528
49
14751
86
855
642
3865
198
56
18
49
40842
1731
28
642
4846
198
3528
37
518
48
855
642
5607
198
3528
37
86
66
32
855
642
4089
198
40
39
45
86
642
2079
198
64
54
1120
10053
198
11215
53
89
66
86
855
49231
198
56
55
49
40842
1495
89
718
2999
198
56
54
7278
718
3070
198
2389
48
28
718
3023
198
64
29767
71
65
32
855
718
2713
198
40
39
15450
57
54
15
28
3126
21
198
3528
18519
66
70
855
718
2998
198
65
18
53
463
32
855
39084
198
40
1677
78
718
2931
198
3528
37
88
44300
198
3528
75
76
718
1157
198
40
39
15450
40692
41
75
718
1065
198
40
39
3629
718
1485
198
40
39
297
56
55
40
28
718
1415
198
56
34278
28
718
1314
198
3528
1314
718
1433
198
40
39
45
85
65
54
52
28
718
1558
198
40
39
4598
57
54
19
28
718
1507
198
65
18
53
2616
32
855
718
1129
198
56
54
2949
45469
198
40
39
15450
56
54
19
28
718
2481
198
31522
52
28
718
1828
198
65
1495
74
718
1954
198
64
29767
81
718
1731
198
3528
5892
40692
40
28
48868
198
36020
23266
718
2075
198
40
29567
16
718
1983
198
34
2188
28
718
2078
198
40
39
45
73
718
1959
198
11215
53
31298
32
855
44505
198
11215
53
75
718
3132
198
40
9527
15
718
2624
198
65
18
53
84
34892
855
718
2091
198
66
38
24
5173
32
855
718
2682
198
3528
37
1416
2078
28
718
2327
198
40
32886
71
31522
48
28
718
2623
198
57
77
49
44601
70
855
718
2718
198
3528
28047
718
2548
198
3528
41
75
56
86
855
718
2670
198
40
17184
40842
54
52
28
33759
198
57
54
20
89
718
3901
198
2389
52
28
718
3682
198
65
18
37000
57
48
855
718
3559
198
40
39
4598
56
55
48
28
718
2598
198
3528
20
85
718
2231
198
57
39
52
28
718
3510
198
65
54
53
88
718
2857
198
56
54
20
77
718
2780
198
3528
20
335
86
855
718
2920
198
6561
15
83
43
48
855
22626
198
3528
67
335
32
855
718
4349
198
65
18
41
20
718
4309
198
64
55
49
40842
1731
28
718
4310
198
64
54
20
10782
86
855
718
4051
198
3528
79
16
66
18
48
28
45021
198
3528
75
463
38
23
28
718
3980
198
41957
28
718
3553
198
57
54
1120
66
86
855
718
3365
198
65
18
57
75
718
3270
198
67
38022
28
41717
198
40
39
3629
65
18
37000
57
48
855
718
5333
198
40
39
3886
57
48
855
718
5237
198
3528
75
15
66
86
855
718
5066
198
40
39
41
75
56
86
855
718
2414
198
40
17184
18
718
2996
198
64
54
41133
43364
198
64
55
41
89
67
32
855
718
3134
198
56
55
50123
718
3104
198
65
18
41
89
718
3388
198
40
39
67
28435
907
28
48136
198
56
18564
75
718
4869
198
65
17
40
28
718
4761
198
40
39
2949
57
48
855
718
4790
198
3528
6420
66
70
855
718
4524
198
67
1731
28
718
2425
198
64
54
20
81
718
4304
198
65
9861
73
718
3324
198
14114
20
718
3695
198
10008
18519
718
3720
198
64
55
2949
40554
198
20475
49
44601
70
855
718
6659
198
56
55
53
89
57
48
855
718
6469
198
3528
24831
65
48
855
718
5999
198
65
1495
89
718
5705
198
5064
82
28
718
5332
198
40
39
41
85
718
4521
198
57
76
24
88
65
48
855
718
5774
198
64
54
87
74
718
3459
198
56
55
49
44601
86
855
718
4531
198
36020
53
88
66
86
855
718
3829
198
3528
24
549
39
74
28
718
6420
198
65
17
34223
718
5892
198
40
39
45
86
57
48
855
718
6052
198
56
17
82
28
718
5824
198
57
54
34223
718
3865
198
56
54
16
86
718
4846
198
3528
37
73
56
86
855
718
5607
198
3528
49044
39861
198
64
54
6420
66
86
855
718
2079
198
67
55
33018
13037
198
57
77
48
28
48173
198
65
1959
74
43379
198
3528
71
20306
86
855
767
3070
198
64
37094
74
767
3023
198
2149
66
28
767
2713
198
3528
37
9132
37094
88
767
3312
198
56
55
66
28
767
2998
198
3528
37
15
67
32
855
767
2919
198
65
18
56
28
767
2931
198
20475
52
28
767
940
198
40
32886
82
56
55
74
28
767
1157
198
40692
41
17
767
1065
198
64
29767
15
767
1485
198
16284
20306
54
87
74
767
1415
198
64
55
49
15
767
1314
198
3528
37
83
767
1433
198
3528
57
14751
77
45
15
767
1558
198
2389
56
28
767
1507
198
3528
37
73
67
32
855
767
1129
198
2149
48
28
26250
198
57
22117
28
767
2481
198
64
38
2290
57
86
855
767
1828
198
67
54
42388
767
1954
198
67
54
34223
767
1731
198
16284
85
65
54
15
28
767
1495
198
65
18
74
28
767
2075
198
65
17
87
74
767
1983
198
56
17
53
89
767
2078
198
56
55
49
44601
70
855
767
1959
198
3528
57
75
767
1270
198
3528
41
335
32
855
767
3132
198
67
17
52
28
767
2624
198
64
54
57
76
767
2091
198
40
17184
18
65
86
855
767
2682
198
65
17
45
81
767
2327
198
3528
41
71
56
17
82
28
767
2623
198
27015
19
28
37517
198
64
18564
75
9374
48
28
767
2548
198
40
39
53
84
57
37094
88
767
2670
198
11215
6420
57
17
70
28
767
1821
198
66
17
23266
767
3901
198
68
41275
28
767
3682
198
3528
16
258
48
855
767
3559
198
11215
6420
20475
48
28
767
2598
198
40
32886
85
767
2231
198
66
38
70
28
767
3510
198
64
55
45
89
45600
198
3528
49
44601
86
855
767
2780
198
3528
16
28435
18
48
28
767
2920
198
3528
49
79
34892
855
19683
198
3528
37
74
34892
855
767
4349
198
321
53
73
67
32
855
767
4309
198
3528
2290
56
86
855
767
4310
198
57
76
24
88
57
48
855
767
4051
198
40
32886
85
65
32
855
767
2816
198
65
9031
767
3980
198
3528
37
77
56
54
2290
767
3553
198
56
17
87
16
34892
855
767
3365
198
67
37094
88
35904
855
767
3270
198
3528
37995
18
66
28
48284
198
3528
20
75
57
54
48
28
767
5333
198
16284
85
9374
44
28
767
5237
198
16284
85
767
5066
198
2149
19
28
767
2414
198
40
39
34985
9374
48
28
767
2996
198
40
39
45
75
57
48
855
767
2791
198
2389
66
28
767
3134
198
20475
2290
57
86
855
46720
198
64
54
53
18
767
3388
198
5064
49
12162
37643
28
44586
198
56
17
53
74
767
4869
198
3528
53
17
57
54
19
28
767
4761
198
3528
2290
34892
855
767
4790
198
67
39
74
28
767
4524
198
5064
25404
767
2425
198
56
55
15450
767
4304
198
40
39
15450
40692
45
75
35534
198
40
39
3886
767
3695
198
40
39
53
89
57
48
855
767
3720
198
3528
41
75
56
17
37
16
66
17
52
28
41287
198
3528
57
82
767
6659
198
20475
66
28
767
6469
198
3528
20
20306
86
855
767
5999
198
9399
25123
46265
855
767
5705
198
56
1959
83
767
5332
198
64
55
45
75
767
4521
198
3528
16
3099
17
52
28
767
5774
198
40
39
15450
57
54
19
28
767
3459
198
65
18
25404
66
70
855
767
4531
198
3528
53
17
40692
41
20
767
3829
198
5064
53
84
767
6420
198
40
39
45
75
56
86
855
767
5892
198
65
18
45
89
767
6052
198
67
54
2949
767
5824
198
3528
53
83
767
3865
198
2389
15
28
767
4846
198
5064
41
75
767
5607
198
64
54
53
74
767
4089
198
66
4029
15
767
2079
198
3528
75
463
70
855
10460
198
65
37094
73
67
32
855
807
486
198
40
39
45
16
66
7801
28
33121
198
56
55
49
79
20475
66
28
807
3070
198
3528
87
85
65
17
82
28
807
3023
198
65
54
41133
807
2713
198
66
37094
73
67
32
855
807
3312
198
2389
70
28
807
2998
198
11215
6052
41241
198
3528
41
16
807
2931
198
40
39
4598
40692
41
75
807
940
198
64
54
57
79
56
86
855
807
1157
198
40
39
297
56
55
41
89
807
1065
198
64
54
87
20
807
1485
198
3528
49
79
57
76
56
28
807
1415
198
40
39
21191
18
23266
34892
855
807
1314
198
40
39
41
23160
48
855
807
1433
198
43490
70
28
807
1558
198
17887
19
28
807
1507
198
3528
53
17
807
1129
198
57
21713
20
48964
198
41
18
41
75
807
2481
198
66
4029
72
807
1828
198
40
39
41
23160
32
855
807
1954
198
66
18
44
28
807
1731
198
3528
49
75
57
70
855
807
1495
198
40
39
41
79
57
17
71
15
807
2075
198
40
39
45
20
807
1983
198
42
10462
28
807
2078
198
65
37094
89
807
1959
198
44
5631
86
807
1270
198
64
37094
84
807
3132
198
40
17184
420
76
6420
57
17
70
28
807
2624
198
5064
46987
807
2091
198
55
1507
28
807
2682
198
40
39
67
258
48
855
807
2327
198
3528
49
85
35904
855
807
2623
198
2149
86
28
807
2718
198
14114
86
807
2548
198
56
55
45
75
34892
855
807
2670
198
3528
37
89
66
86
855
48777
198
67
54
41
11400
22117
28
807
3901
198
40
39
41
75
57
86
855
807
3682
198
10008
41133
34892
855
807
3559
198
64
55
70
28
807
2598
198
40
39
57
75
31522
74
28
807
2231
198
3528
2290
56
17
87
16
34892
855
807
3510
198
65
18
15450
40692
40
28
807
2857
198
3528
2528
66
32
855
807
2780
198
65
18
15450
807
2920
198
40
39
45
16
56
70
855
30607
198
9399
42
2348
32
855
807
4349
198
3528
41
5031
54
20
77
807
4309
198
56
55
41
77
807
4310
198
5064
4598
807
4051
198
11571
15
28
807
2816
198
64
54
49044
57
48
855
807
3980
198
3528
49
85
57
37643
28
807
3553
198
56
54
20
77
57
48
855
807
3365
198
11215
37
83
807
3270
198
2389
74
28
807
1899
198
40692
41
15
807
5333
198
66
36905
28
807
5237
198
64
55
49
75
34892
855
807
5066
198
56
55
49
40842
1495
71
65
32
855
807
2414
198
3528
41
88
807
2996
198
3528
49
20306
1731
28
807
2791
198
3528
16
71
9374
74
28
807
3134
198
56
54
34788
20475
66
28
807
3104
198
16284
71
65
38
86
28
807
3388
198
67
55
41
79
20475
66
28
807
2154
198
64
55
49
79
57
37643
28
807
4869
198
40
39
16635
807
4761
198
64
29767
89
807
4790
198
56
54
87
89
807
4524
198
3528
49
75
56
86
855
807
2425
198
56
55
49
30094
76
52
28
807
4304
198
57
54
20
44601
70
855
807
3324
198
3528
41
75
57
76
24
88
57
48
855
807
3695
198
64
54
87
30094
39
74
28
807
3720
198
40
39
67
23160
38
86
28
807
1795
198
3528
1157
56
17
70
28
807
6659
198
40692
41
14969
1731
28
807
6469
198
40
39
14350
18
45
75
807
5999
198
40
39
45
16
56
17
70
28
807
5705
198
3528
28781
807
5332
198
3528
53
84
34892
855
807
4521
198
10008
41
16
67
32
855
807
5774
198
56
55
45
85
35904
855
807
3459
198
67
38
2290
57
86
855
807
4531
198
3528
87
85
20475
66
28
807
3829
198
57
54
56
28
807
6420
198
40
17184
12162
54
20
81
807
5892
198
68
37643
28
807
6052
198
3528
41
23160
32
855
807
5824
198
40
39
45
83
807
3865
198
64
55
49
89
807
4846
198
56
55
70
28
807
5607
198
3528
6052
35904
855
807
4089
198
40
39
3886
65
18
56
28
807
2079
198
40
39
45
335
32
855
15897
198
64
54
57
75
860
486
198
65
54
53
463
36905
28
860
2999
198
56
36802
75
860
3070
198
67
17
37
88
34892
855
860
3023
198
40
39
21191
18
66
28
860
2713
198
40
39
3886
57
37643
28
860
3312
198
65
37643
28
860
2998
198
65
2481
335
32
855
860
2919
198
3528
24
72
860
2931
198
40
39
45
258
48
855
860
940
198
5064
2949
16679
198
67
36905
28
860
1065
198
57
77
23266
860
1485
198
3528
53
76
57
70
855
860
1415
198
3528
67
16
860
1314
198
3528
75
1229
18
48
28
860
1433
198
67
54
20
74
860
1558
198
11215
53
84
860
1507
198
56
17
53
89
66
86
855
860
1129
198
3528
53
463
32
855
47679
198
5064
6780
67
48
855
860
2481
198
3528
67
85
65
17
48
28
860
1828
198
40
39
45
15
56
55
41
15
860
1954
198
64
54
20
73
57
48
855
860
1731
198
3528
16
71
57
38022
28
860
1495
198
67
41275
28
860
2075
198
66
18
49
23160
48
855
860
1983
198
65
17
87
85
57
86
855
860
2078
198
67
55
32
28
860
1959
198
40
39
86
28
860
1270
198
67
54
16
86
860
3132
198
3528
18519
65
32
855
860
2624
198
36020
53
88
35904
855
860
2091
198
67
54
87
71
66
70
855
860
2682
198
67
48397
36299
39
74
28
860
2327
198
3528
37
73
860
2623
198
3528
16
85
35904
855
860
2718
198
3528
87
71
66
18
48
28
860
2548
198
2389
40
86
5673
855
860
2670
198
44
5603
28
860
1821
198
40
39
45
15
67
54
48
28
860
3901
198
67
55
41
44601
86
855
860
3682
198
10008
37
88
860
3559
198
66
17
23266
57
70
855
860
2598
198
56
55
41
89
860
2231
198
65
54
53
3972
22117
28
860
3510
198
67
54
53
89
860
2857
198
56
18
74
28
860
2780
198
3528
16
79
35904
855
860
2920
198
65
17
34223
65
18
66
28
38384
198
16284
85
65
32
855
860
4349
198
64
54
23
28
860
4309
198
3528
16
85
34892
855
860
4310
198
16284
20306
54
1120
860
4051
198
40
1677
85
65
48
855
860
2816
198
64
37094
89
860
3980
198
3528
57
79
35904
855
860
3553
198
56
54
306
860
3365
198
64
54
53
88
860
3270
198
19
78
43633
41263
198
11215
53
71
34892
855
860
5333
198
56
54
20
81
860
5237
198
56
55
49
6592
32
855
860
5066
198
40692
57
44601
70
855
860
2414
198
40
39
45
15
66
70
855
860
2996
198
40
32886
6862
54
1120
860
2791
198
65
18
50123
860
3134
198
10008
20
335
86
855
860
3104
198
40
39
45
16
66
70
855
860
3388
198
65
1959
82
40463
198
56
54
87
81
860
4869
198
57
54
16
75
9374
48
28
860
4761
198
40
39
53
89
57
54
48
28
860
4790
198
11215
37
73
67
32
855
860
4524
198
67
17
53
23160
70
855
860
2425
198
40
39
45
71
65
54
52
28
860
4304
198
65
18
53
84
860
3324
198
10008
42388
41417
198
56
17
74
28
860
3720
198
3528
49
79
57
76
57
75
11215
52
28
32614
198
40
39
4598
64
54
87
75
860
6659
198
6561
15
83
6561
15
83
6561
15
28
860
6469
198
3528
34985
65
54
52
28
860
5999
198
56
17
53
16993
32
855
860
5705
198
40
39
45
40842
48
855
860
5332
198
32304
19
84
860
4521
198
3528
75
463
37094
88
860
5774
198
57
46456
28
860
3459
198
40
39
41
44601
38
24
5173
32
855
860
4531
198
40
39
3886
65
17
49
16
860
3829
198
40
39
45
15
64
54
34223
860
6420
198
65
37094
74
860
5892
198
56
54
70
28
860
6052
198
3528
18519
11215
52
28
860
5824
198
40
39
67
85
11215
87
74
860
3865
198
40
39
14350
18
53
2616
32
855
860
4846
198
3528
4349
65
48
855
860
5607
198
56
55
41
6592
32
855
860
4089
198
64
54
16
44601
86
855
36006
198
56
54
87
75
8576
198
5064
45
75
1802
16
198
40
9527
76
1802
17
198
31633
23
28
1802
18
198
40
3109
75
1802
19
198
40
39
41
335
32
855
1802
20
198
40
39
41
75
57
70
855
1802
21
198
40
17184
88
56
54
20
89
1802
22
198
20475
53
88
1802
23
198
67
55
49
40842
1731
28
1802
24
198
67
37094
88
66
86
855
8949
15
198
40
17184
3099
17
52
28
8949
16
198
40
1677
82
8949
17
198
16284
85
20475
56
28
8949
18
198
67
17
37
20
8949
19
198
56
55
57
75
8949
20
198
3528
67
6862
54
20
77
8949
21
198
40
39
47503
8949
22
198
67
54
66
28
8949
23
198
10008
37
83
40692
41
79
56
86
855
8949
24
198
40
39
45
86
57
22117
28
838
1238
198
3528
12337
20475
48
28
838
2481
198
3528
41
335
39
25404
57
54
19
28
838
1828
198
64
55
45
15
66
86
855
838
1954
198
38311
75
28119
198
65
24369
838
1495
198
50
55
48
28
838
2075
198
3528
53
71
66
70
855
838
1983
198
3528
37
77
56
54
75
1229
18
48
28
838
2078
198
3528
24831
57
17
70
28
838
1959
198
57
17
41133
838
1270
198
56
55
78
28
838
3132
198
56
55
15450
40692
40
28
838
2624
198
3528
53
19
66
32
855
838
2091
198
3528
24
86
838
2682
198
3528
75
1229
86
855
838
2327
198
3528
9892
838
2623
198
3528
18519
65
7801
28
838
2718
198
40
39
41
44601
55
52
28
838
2548
198
40692
49
89
838
2670
198
64
54
20
89
838
1821
198
5064
3886
65
86
855
838
3901
198
64
55
45
83
838
3682
198
3528
57
20306
54
20
74
838
3559
198
65
21713
84
34892
855
838
2598
198
56
55
38576
838
2231
198
67
55
45
89
838
3510
198
56
54
16
44601
86
855
838
2857
198
40
39
3629
31522
45
85
35904
855
838
2780
198
3528
9892
57
48397
15
838
2920
198
66
25374
28
47235
198
40
39
45
79
57
1731
28
838
4349
198
10008
41133
838
4309
198
41
18
57
75
838
4310
198
40
39
45
85
65
54
53
15
838
4051
198
40
39
45
44601
70
855
838
2816
198
64
9861
86
838
3980
198
40
39
41
16
35904
855
838
3553
198
2389
78
28
838
3365
198
40
17184
44601
70
855
838
3270
198
64
55
41
75
56
18
48
28
838
1899
198
3528
57
85
65
38
87
20306
86
855
838
5333
198
3528
49
335
32
855
838
5237
198
64
29767
44601
86
855
838
5066
198
3528
57
79
20475
48
28
838
2414
198
13752
40
28
838
2996
198
3528
16
23160
48
855
838
2791
198
16284
88
838
3134
198
40692
41
75
34892
855
838
3104
198
40692
70
28
838
3388
198
3528
53
19
67
32
855
49616
198
67
55
15450
838
4869
198
57
54
20
89
57
48
855
838
4761
198
56
2078
28
838
4790
198
40
17184
75
56
54
15
28
838
4524
198
36020
2290
57
86
855
838
2425
198
65
18
53
89
57
48
855
838
4304
198
56
55
2949
838
3324
198
56
55
49
15
838
3695
198
36020
53
74
838
3720
198
40
39
45
20
66
18
49
23160
48
855
17729
198
10008
37
89
838
6659
198
57
37094
88
838
6469
198
64
55
57
44601
86
855
838
5999
198
65
54
2290
838
5705
198
3528
87
75
56
54
48
28
838
5332
198
10008
49044
838
4521
198
56
17
53
463
32
855
838
5774
198
3528
37
88
65
18
53
84
34892
855
838
3459
198
3528
67
20306
76
53
88
35904
855
838
4531
198
16284
16
66
70
855
838
3829
198
36020
23266
65
18
32
28
838
6420
198
56
54
2816
838
5892
198
16284
20306
55
40
28
838
6052
198
56
54
87
15
64
32
855
838
5824
198
56
54
25404
66
86
855
838
3865
198
64
55
489
838
4846
198
16284
71
66
70
855
838
5607
198
65
17
49
75
838
4089
198
3528
87
31298
86
855
838
2079
198
40
39
41
75
56
54
48
28
36566
198
41
1238
28
1367
486
198
56
1959
84
9796
17
198
40
39
41
75
56
54
86
28
9796
18
198
40
39
45
16
66
32886
28435
77
48
28
9796
19
198
14114
88
9796
20
198
32304
19
84
43
70
855
9796
21
198
40
39
41
75
56
54
87
325
48
855
9796
22
198
20475
53
89
66
86
855
9796
23
198
3528
57
71
56
18
48
28
9796
24
198
3528
49
258
48
855
1367
940
198
3528
41
20306
38
70
28
13374
16
198
68
54
2290
57
86
855
1367
1065
198
40
39
45
75
31522
56
28
13374
18
198
10008
57
28435
70
855
13374
19
198
40
17184
420
76
53
75
13374
20
198
40
39
67
85
65
48
855
13374
21
198
3528
16
75
34892
855
13374
22
198
65
17
49
20
13374
23
198
5064
15450
40692
74
28
1367
1129
198
45
5603
28
352
10232
198
3528
53
19
66
37094
88
13539
16
198
67
38
24
84
13539
17
198
3528
53
71
56
17
70
28
352
10163
198
56
54
28781
66
86
855
13539
19
198
3528
2949
57
48
855
352
11623
198
16284
88
57
48
855
13539
21
198
64
54
20
44601
86
855
13539
22
198
40
39
41
44601
32
855
352
12762
198
13752
74
28
13539
24
198
57
17
66
28
1367
1270
198
64
54
87
11400
54
24
84
1367
3132
198
3528
9892
65
18
52
28
1367
2624
198
67
55
49
75
1367
2091
198
64
46456
28
1367
2682
198
53
17
52
28
1367
2327
198
57
17
53
15
1367
2623
198
49
12861
28
1367
2718
198
3528
16
335
32
855
1367
2548
198
40
39
45
258
37643
28
1367
2670
198
65
18
70
28
1367
1821
198
3528
49
16
11215
2290
57
86
855
1367
3901
198
40692
33018
1367
3682
198
64
55
489
34892
855
1367
3559
198
56
55
41
75
34892
855
1367
2598
198
3528
57
71
65
48
855
1367
2231
198
64
29767
71
65
38
87
20
1367
3510
198
3528
12337
66
7801
28
1367
2857
198
40
9527
89
1367
2780
198
3528
2949
56
55
40
28
1367
2920
198
65
54
53
74
1367
1120
198
36020
53
463
32
855
12279
16
198
3528
25404
20475
53
88
12279
17
198
64
54
53
463
32
855
12279
18
198
66
38
87
75
12279
19
198
64
54
53
15
12279
20
198
11215
53
463
32
855
12279
21
198
44
9328
28
12279
22
198
36020
53
89
12279
23
198
66
17184
40842
1731
28
12279
24
198
2389
40
86
1367
1899
198
57
76
24
88
65
48397
15
64
54
24
84
1367
5333
198
16284
28435
70
855
1367
5237
198
3528
24
76
57
4029
73
1367
5066
198
64
54
23266
34892
855
1367
2414
198
40
17184
85
65
86
855
1367
2996
198
64
55
45
40842
1731
28
1367
2791
198
3528
2290
57
70
855
1367
3134
198
5064
78
28
1367
3104
198
67
38
18519
1367
3388
198
65
17
37
74
1367
2154
198
40
32886
16
56
36802
79
56
86
855
1367
4869
198
40
39
3886
65
17
66
28
1367
4761
198
66
4029
73
1367
4790
198
42
952
28
1367
4524
198
40
39
34985
66
70
855
1367
2425
198
40
32886
20306
17
53
88
1367
4304
198
36020
297
67
86
855
1367
3324
198
3528
57
335
86
855
1367
3695
198
3528
87
85
56
86
855
1367
3720
198
3528
49
79
57
76
57
75
11215
53
463
32
855
1367
1795
198
40
39
45
15
56
55
49
75
1367
6659
198
3528
18519
56
54
48
28
1367
6469
198
41
17
34223
1367
5999
198
40
32886
28435
18
44
28
1367
5705
198
40
39
45
15
56
55
48
28
1367
5332
198
11215
53
15
1367
4521
198
56
54
1120
66
86
855
1367
5774
198
40
39
57
71
65
32
855
1367
3459
198
3528
75
89
66
86
855
1367
4531
198
16284
82
57
48
855
15136
15
198
64
55
57
75
31522
44
28
15136
16
198
56
54
20
73
15136
17
198
3528
53
19
66
38
86
28
15136
18
198
3528
37
549
18
15450
40692
40
28
15136
19
198
29150
28
15136
20
198
3528
37
17
15136
21
198
67
38
24831
20475
66
28
15136
22
198
20475
45
75
15136
23
198
53
17
70
28
15136
24
198
3528
2949
64
54
87
74
24938
198
40
39
45
79
20475
45
75
1105
486
198
64
55
41
75
34892
855
1105
2999
198
65
37094
89
66
86
855
1105
3070
198
3528
42372
57
76
52
28
1105
3023
198
3528
49
335
76
23266
65
18
32
28
1105
2713
198
64
55
49
15
65
38022
28
1105
3312
198
3528
49
44601
32
855
1105
2998
198
40
32886
71
66
18
44
28
1105
2919
198
2598
44
28
1105
2931
198
40
17184
16
11215
19
28
1105
940
198
65
18
33018
1105
1157
198
53
41126
14751
86
855
1105
1065
198
56
76
53
88
66
86
855
1105
1485
198
11215
24
89
66
86
855
1105
1415
198
10008
37
74
1105
1314
198
3528
57
88
1105
1433
198
40
39
41
44601
18
32
28
1105
1558
198
40
39
45
75
56
1959
84
34892
855
1105
1507
198
65
17
70
28
1105
1129
198
2149
23
28
1105
1238
198
3528
49
14751
17
44
28
1105
2481
198
2149
56
28
1105
1828
198
40
39
45
85
65
54
53
15
64
38
2290
57
86
855
1105
1954
198
16284
85
65
55
37000
57
48
855
1105
1731
198
3528
53
74
1105
1495
198
3528
57
40842
32
855
1105
2075
198
3528
16
85
9374
15450
1105
1983
198
56
49450
28
1105
2078
198
67
22117
28
1105
1959
198
3528
67
20306
76
53
88
20475
16
75
9374
48
28
1105
1270
198
40
39
26059
67
41126
20306
55
48
28
1105
3132
198
3528
87
75
57
86
855
1105
2624
198
3528
49
14751
18
48
28
1105
2091
198
40
32886
16
67
32
855
1105
2682
198
40
29567
16
40692
45
15
1105
2327
198
56
54
20
84
1105
2623
198
40
39
3886
65
18
48
28
1105
2718
198
44
73
32
28
1105
2548
198
3528
20
335
76
53
88
1105
2670
198
64
54
53
84
56
17
52
28
1105
1821
198
3528
87
335
76
23266
1105
3901
198
3528
37
5173
32
855
1105
3682
198
40
17184
12162
54
20
10782
86
855
1105
3559
198
3528
16
79
57
17
71
15
1105
2598
198
3528
53
76
57
76
53
73
67
32
855
1105
2231
198
16284
85
9374
46987
65
86
855
1105
3510
198
16284
75
9374
48
28
1105
2857
198
14114
19
1105
2780
198
3528
37
36299
38
6052
1105
2920
198
3528
41
23160
38
297
1105
1120
198
56
17
71
85
65
17
86
28
1105
4349
198
65
18
49
15
1105
4309
198
3528
2290
56
18
41
75
1105
4310
198
3528
57
75
57
54
86
28
1105
4051
198
40
39
41
44601
18
53
21282
32
855
1105
2816
198
3528
87
20306
32
855
1105
3980
198
3528
57
16
35904
855
1105
3553
198
65
18
49
75
1105
3365
198
40
17184
20
1105
3270
198
40692
41
44601
18
48
28
1105
1899
198
16284
85
9374
49
79
35904
855
1105
5333
198
40
39
53
4496
54
20
77
1105
5237
198
3528
41
79
57
86
855
1105
5066
198
44
73
31554
1105
2414
198
3528
37
89
707
855
1105
2996
198
3528
41
44601
18
48
28
1105
2791
198
2149
74
28
1105
3134
198
12564
19
28
1105
3104
198
3528
24
86
66
32
855
1105
3388
198
44
89
32
28
1105
2154
198
3528
4349
65
54
41
44601
70
855
1105
4869
198
64
54
20
44601
18
44
28
1105
4761
198
52
18
48
28
1105
4790
198
65
37094
71
66
17
52
28
1105
4524
198
16284
71
1105
2425
198
3528
1157
66
18
48
28
1105
4304
198
3528
49
79
11215
53
73
67
32
855
1105
3324
198
3528
9310
1105
3695
198
2389
86
28
1105
3720
198
3528
24
86
57
54
19
28
37674
198
40
32886
28435
18
48
28
1105
6659
198
16284
85
65
54
52
28
1105
6469
198
40
39
45
75
57
54
15
28
1105
5999
198
65
18
41
4914
54
20
77
1105
5705
198
40
39
25404
57
46456
28
1105
5332
198
56
55
49
23160
39
74
28
1105
4521
198
64
55
38576
65
32
855
1105
5774
198
3528
23266
1105
3459
198
11215
297
20475
48
28
1105
4531
198
3528
57
71
66
70
855
1105
3829
198
40
17184
88
56
48
855
1105
6420
198
64
54
20
71
65
32
855
1105
5892
198
40
39
3886
64
48
855
1105
6052
198
5064
36392
1105
5824
198
40
32886
82
56
29767
75
1105
3865
198
3528
57
85
11215
15
28
1105
4846
198
40
17184
85
65
38
48
28
1105
5607
198
40
7639
28
1105
4089
198
56
54
75
1229
86
855
1105
2079
198
56
55
49
16
11215
52
28
36058
198
5064
49
5173
54
16
86
1511
486
198
40
39
45
15
56
54
20
74
11323
17
198
2149
44
28
11323
18
198
64
18564
44601
70
855
11323
19
198
10008
57
88
11323
20
198
3528
20
293
41275
28
11323
21
198
40
39
45
85
56
86
855
11323
22
198
40
32886
16
66
70
855
11323
23
198
3528
87
335
32
855
11323
24
198
3528
87
30094
17184
82
57
48
855
1511
940
198
3528
71
16
65
48
855
1511
1157
198
3528
74
28
1511
1065
198
11215
24
84
1511
1485
198
13752
52
28
1511
1415
198
14114
16
1511
1314
198
16284
85
65
54
1157
35904
855
1511
1433
198
3528
16
71
46406
28
1511
1558
198
5064
15450
40692
41
75
1511
1507
198
40
39
9892
1511
1129
198
5064
15450
56
55
48
28
1511
1238
198
3528
2290
57
76
24
88
65
48397
15
64
54
24
84
1511
2481
198
67
17
37
20
66
86
855
1511
1828
198
3528
41
16
66
86
855
1511
1954
198
56
55
33
86
1511
1731
198
3528
75
463
76
53
89
67
32
855
1511
1495
198
65
54
52
28
1511
2075
198
3528
12337
11215
48
28
1511
1983
198
56
54
2290
57
54
48
28
1511
2078
198
57
48397
74
1511
1959
198
3528
2528
66
38
24
5173
32
855
1511
1270
198
3528
37
86
66
39
41
85
1511
3132
198
40
17184
44601
18
48
28
1511
2624
198
40
17184
3972
48
855
1511
2091
198
40
39
41
44601
18
48
28
1511
2682
198
65
18
45
75
34892
855
1511
2327
198
3528
57
16
65
38
86
28
1511
2623
198
16284
71
11215
52
28
1511
2718
198
5064
45
86
1511
2548
198
16284
71
66
17
52
28
1511
2670
198
51
3023
28
1511
1821
198
40
39
45
81
1511
3901
198
3528
87
44601
18
44
28
1511
3682
198
2149
82
28
1511
3559
198
40
32886
71
31522
49
79
56
86
855
1511
2598
198
5064
37000
1511
2231
198
56
54
41
325
48
855
1511
3510
198
67
29767
81
1511
2857
198
64
55
2949
57
54
48
28
1511
2780
198
56
17
13415
1511
2920
198
56
76
52
28
1511
1120
198
3528
87
14751
18
48
28
1511
4349
198
56
55
49
28435
70
855
1511
4309
198
40
17184
28435
32
855
1511
4310
198
3528
37
74
67
70
855
1511
4051
198
10008
41
75
1511
2816
198
31522
53
73
67
32
855
1511
3980
198
3528
49
23160
48
855
1511
3553
198
11215
37
15
64
54
24
84
1511
3365
198
65
38
2290
57
86
855
1511
3270
198
57
18
74
28
1511
1899
198
11215
53
23160
70
855
1511
5333
198
57
17
53
88
1511
5237
198
3528
71
85
65
54
52
28
1511
5066
198
3528
87
75
57
77
48
28
1511
2414
198
3528
41
335
17184
44601
70
855
1511
2996
198
3528
49
31298
8264
28
1511
2791
198
2389
3109
1511
3134
198
3528
37
15
67
21713
73
707
855
1511
3104
198
40
39
3886
65
17
49044
57
48
855
1511
3388
198
65
38
2290
57
48
855
1511
2154
198
56
55
41
74
66
86
855
1511
4869
198
3528
41
5031
32
855
1511
4761
198
11215
42388
1511
4790
198
10008
71
20306
86
855
1511
4524
198
5064
2949
57
48
855
1511
2425
198
56
55
41
77
57
48
855
1511
4304
198
2149
15
83
1511
3324
198
46
72
23
85
1511
3695
198
3528
41
88
65
86
855
1511
3720
198
5064
16635
1511
1795
198
56
55
49
89
1511
6659
198
3528
41
16
64
54
87
74
1511
6469
198
67
18
66
28
1511
5999
198
64
18564
75
34892
855
1511
5705
198
56
54
2528
1511
5332
198
56
55
45
44601
86
855
1511
4521
198
57
54
20
18015
48
855
1511
5774
198
3528
16
3099
54
19
28
1511
3459
198
64
54
20
75
34892
855
1511
4531
198
3528
2290
56
17
87
16
57
38
2290
57
86
855
1511
3829
198
40
39
82
28
1511
6420
198
3528
67
20306
32
855
1511
5892
198
3528
75
463
37094
88
40692
45
15
1511
6052
198
3528
28781
40692
32
28
1511
5824
198
5064
70
28
1511
3865
198
3528
53
71
66
86
855
1511
4846
198
56
54
40211
54
20
77
1511
5607
198
16284
82
56
55
45
89
1511
4089
198
19
78
34
76
1511
2079
198
10008
20
85
36641
198
40
39
57
71
66
70
855
1478
486
198
40
39
45
83
56
54
34223
1478
2999
198
56
54
16
39346
38022
28
1478
3070
198
48
53
48
28
1478
3023
198
3528
75
74
57
48
855
1478
2713
198
5064
45
85
1478
3312
198
40
39
41
75
56
17
52
28
1478
2998
198
40
32886
85
65
9861
15
1478
2919
198
3528
16
20306
70
855
1478
2931
198
40
32886
82
56
54
19
28
1478
940
198
40
39
3629
11215
45
75
9374
48
28
1478
1157
198
64
55
57
79
20475
66
28
1478
1065
198
16284
71
65
55
32
28
1478
1485
198
40
32886
258
48
855
1478
1415
198
13752
48
28
1478
1314
198
66
17
44
28
1478
1433
198
64
55
45
75
34892
855
1478
1558
198
40
39
53
463
32
855
1478
1507
198
65
1495
293
48
855
1478
1129
198
66
38
87
303
48
855
1478
1238
198
11571
2931
47
48
855
1478
2481
198
3528
49
79
57
38
19
28
1478
1828
198
10008
2290
34892
855
1478
1954
198
57
54
87
89
1478
1731
198
40692
41
15
56
54
2290
1478
1495
198
40
32886
28435
86
855
1478
2075
198
55
1129
69
55
86
855
1478
1983
198
64
55
57
44601
70
855
1478
2078
198
40
39
3886
65
17
45
44601
18
44
28
1478
1959
198
40
39
3886
65
17
9892
56
54
15
28
1478
1270
198
64
54
57
79
57
54
48
28
1478
3132
198
5064
41
44601
32
855
1478
2624
198
44
9936
28
1478
2091
198
67
55
41
85
1478
2682
198
65
17
87
85
57
18
74
28
1478
2327
198
56
55
49
15
40692
40
28
1478
2623
198
64
54
20
71
1478
2718
198
3528
20
71
65
54
52
28
1478
2548
198
10008
37
36299
32
855
1478
2670
198
3528
57
20306
55
40
28
49557
198
40
39
41
335
39
53
88
35904
855
1478
3901
198
67
4029
20306
37643
28
1478
3682
198
56
77
44
28
1478
3559
198
16284
71
65
38
87
75
34892
855
1478
2598
198
3528
16
20306
76
52
28
1478
2231
198
5064
45
73
1478
3510
198
64
55
41
74
1478
2857
198
3528
9892
65
18
53
86
1478
2780
198
3528
41
88
57
48
855
1478
2920
198
3528
16
23160
70
855
1478
1120
198
16284
71
66
32
855
1478
4349
198
67
37094
84
1478
4309
198
57
54
52
28
1478
4310
198
3528
49
3972
48
855
1478
4051
198
65
37094
77
1478
2816
198
64
37094
88
57
48
855
1478
3980
198
67
55
14350
18
40
28
1478
3553
198
40
32886
31298
32
855
1478
3365
198
16284
16
31522
41
75
9374
48
28
1478
3270
198
64
18564
44601
86
855
1478
1899
198
40
32886
28435
32
855
1478
5333
198
67
38
23
28
1478
5237
198
57
54
1120
64
54
24
84
1478
5066
198
3528
37
21282
17
37
20
66
86
855
1478
2414
198
3528
16
40842
32
855
1478
2996
198
40
39
67
85
65
54
53
84
1478
2791
198
14114
17
1478
3134
198
3528
24
82
34892
855
1478
3104
198
64
55
57
23160
70
855
1478
3388
198
11215
37
10247
32
855
1478
2154
198
10008
24
88
1478
4869
198
11215
24
88
1478
4761
198
57
54
1120
65
39
74
28
1478
4790
198
3528
20
75
56
55
40
28
1478
4524
198
10008
53
19
1478
2425
198
11215
53
71
65
48
855
1478
4304
198
66
17
70
28
1478
3324
198
14114
15
1478
3695
198
3528
57
88
57
54
52
28
1478
3720
198
64
55
45
4496
54
24
84
1478
1795
198
66
18
38576
20475
48
28
1478
6659
198
40
1677
85
35904
855
1478
6469
198
56
54
87
30094
39
74
28
1478
5999
198
67
55
45
75
34892
855
1478
5705
198
13752
44
28
1478
5332
198
3528
49
44601
17
18755
35904
855
1478
4521
198
3528
2949
56
54
20
77
57
48
855
1478
5774
198
3528
2949
56
54
20
77
1478
3459
198
3528
41
85
1478
4531
198
40
39
57
14751
86
855
1478
3829
198
57
54
16
72
40692
40
28
1478
6420
198
3528
41
85
65
17
82
28
1478
5892
198
11215
53
71
57
39
74
28
1478
6052
198
3528
34788
65
38
86
28
1478
5824
198
44
73
52
28
1478
3865
198
66
39
3629
34892
855
1478
4846
198
3528
37
18
56
55
74
28
1478
5607
198
3528
37
571
38022
28
1478
4089
198
16284
20306
54
1120
31522
74
28
1478
2079
198
16284
85
9374
45
15
20007
198
56
55
33018
1315
486
198
3528
24
88
57
37094
88
6640
17
198
48
12861
28
6640
18
198
64
54
24
88
6640
19
198
64
55
53
83
6640
20
198
65
18
41
15
64
32
855
6640
21
198
13752
70
28
6640
22
198
56
54
7278
56
54
49044
57
48
855
6640
23
198
40
39
45
18
6640
24
198
3528
16
40842
38
87
40842
1731
28
1315
940
198
14114
89
1315
1157
198
56
55
49
79
56
86
855
1315
1065
198
67
37094
74
1315
1485
198
40
7407
85
1315
1415
198
3528
24
86
40692
40
28
1315
1314
198
57
54
20
77
1315
1433
198
40
17184
12162
54
20
77
1315
1558
198
56
54
79
28435
70
855
1315
1507
198
56
1959
549
1238
28
1315
1129
198
40
1677
85
65
54
15
28
1315
1238
198
40
39
67
2577
48
855
1315
2481
198
67
55
41
75
34892
855
1315
1828
198
67
55
41
71
65
32
855
1315
1954
198
40
39
45
6592
38
24
85
65
32
855
1315
1731
198
56
77
74
28
1315
1495
198
10008
16
71
66
70
855
1315
2075
198
3528
37
76
57
70
855
1315
1983
198
3528
49
258
37643
28
1315
2078
198
3528
37
549
70
855
1315
1959
198
67
55
2949
1315
1270
198
56
54
20
75
1315
3132
198
17887
56
28
1315
2624
198
57
54
66
28
1315
2091
198
40
39
3886
65
17
56
28
1315
2682
198
3528
18519
56
54
87
15
64
32
855
1315
2327
198
65
18
53
15
64
32
855
1315
2623
198
48
77
53
15
1315
2718
198
64
54
24
84
56
54
86
28
1315
2548
198
43
14246
28
1315
2670
198
40
39
45
85
65
32
855
1315
1821
198
3528
37
1416
76
53
71
57
39
74
28
1315
3901
198
2389
44
86
1315
3682
198
3528
2949
56
55
41
71
56
18
48
28
1315
3559
198
50
38022
28
1315
2598
198
3528
57
3972
54
53
84
34892
855
1315
2231
198
49
15996
28
1315
3510
198
64
48397
1229
86
855
1315
2857
198
64
29767
82
57
48
855
1315
2780
198
41
17
48
28
1315
2920
198
10008
24
84
1315
1120
198
3528
87
75
56
55
45
15
1315
4349
198
40
39
3886
65
1238
28
1315
4309
198
3528
46987
1315
4310
198
3528
71
14751
18
48
28
1315
4051
198
64
55
15450
40692
40
28
1315
2816
198
3528
53
89
67
32
855
1315
3980
198
64
55
37
16
1315
3553
198
13752
66
28
1315
3365
198
66
1959
84
1315
3270
198
40
17184
23160
38
86
28
1315
1899
198
40
17184
71
65
33884
28
1315
5333
198
65
17
13415
1315
5237
198
65
17
75
463
32
855
1315
5066
198
65
37094
73
67
38
6780
35904
855
1315
2414
198
10917
19
28
1315
2996
198
40
39
53
463
38
7278
1315
2791
198
56
55
53
2616
32
855
1315
3134
198
3528
87
31298
37094
88
1315
3104
198
40
39
57
75
1315
3388
198
40
39
57
79
40692
66
28
1315
2154
198
57
54
20
4914
54
20
77
1315
4869
198
64
55
57
75
34892
855
1315
4761
198
40
39
67
85
11215
48
28
1315
4790
198
67
17
37
88
57
48
855
1315
4524
198
16284
28435
18
48
28
1315
2425
198
3528
53
549
18
53
2616
32
855
1315
4304
198
3528
26059
36020
52
28
1315
3324
198
5064
53
6413
55
49
75
34892
855
1315
3695
198
40
17184
75
56
17
13415
1315
3720
198
56
55
41
75
9374
48
28
1315
1795
198
51
16
40
28
1315
6659
198
40
32886
71
66
70
855
1315
6469
198
38311
88
1315
5999
198
2389
40
86
44
9936
28
1315
5705
198
66
4029
89
67
32
855
1315
5332
198
40692
41
79
20475
66
28
1315
4521
198
3955
40
28
1315
5774
198
3528
87
71
28758
75
1315
3459
198
66
17
75
74
57
48
855
1315
4531
198
56
29767
20
1315
3829
198
56
17
45
44601
18
44
28
1315
6420
198
40
39
26059
35904
855
1315
5892
198
3528
2528
66
38
24
5173
21713
463
32
855
1315
6052
198
14114
20
46
48
855
1315
5824
198
3528
49
85
40692
45
84
1315
3865
198
14114
18
1315
4846
198
3528
41
16
66
17
2290
40692
45
89
1315
5607
198
16284
82
57
48397
88
1315
4089
198
40
39
41
44601
17
52
28
1315
2079
198
40
14246
28
26143
198
67
55
41
20
1467
486
198
3528
53
24954
48
855
1467
2999
198
56
55
45
15
40692
40
28
1467
3070
198
56
54
87
76
1467
3023
198
10008
37
83
40692
41
79
56
17
41133
1467
2713
198
20475
53
73
67
32
855
1467
3312
198
3528
53
19
66
37094
73
67
32
855
1467
2998
198
64
55
57
75
31522
45
30094
39
74
28
1467
2919
198
3528
24
73
56
86
855
1467
2931
198
10008
57
82
1467
940
198
3528
34788
20475
48
28
1467
1157
198
3528
16
75
56
54
19
28
1467
1065
198
40
32886
71
66
18
48
28
1467
1485
198
3528
49
335
70
855
1467
1415
198
3528
41
71
66
86
855
1467
1314
198
65
37094
15
1467
1433
198
11215
37
9132
32
855
1467
1558
198
3528
24
88
57
17
41133
1467
1507
198
3528
49
23160
32
855
1467
1129
198
40
39
3629
11215
57
85
11215
15
28
1467
1238
198
40
39
45
15
65
18
41
20
1467
2481
198
40
39
45
75
56
55
45
85
35904
855
1467
1828
198
40
1677
85
65
32
855
1467
1954
198
16284
82
56
54
2528
1467
1731
198
16284
71
65
54
52
28
1467
1495
198
40
39
26059
67
38
24831
35904
855
1467
2075
198
3528
42372
20475
52
28
1467
1983
198
40
39
3886
65
17
489
56
18
48
28
1467
2078
198
10008
37
15
1467
1959
198
16284
85
9374
46987
65
17
86
28
1467
1270
198
57
54
20
74
57
54
48
28
1467
3132
198
5064
45
20
1467
2624
198
3528
37
14751
70
855
1467
2091
198
64
55
746
67
38
6780
35904
855
1467
2682
198
2149
78
28
1467
2327
198
65
37094
20
1467
2623
198
3528
16
85
20475
53
20
1467
2718
198
64
18564
74
1467
2548
198
17947
6420
1467
2670
198
57
76
24
88
1467
1821
198
3528
57
71
65
54
75
325
48
855
1467
3901
198
3528
16
3099
17
2290
57
86
855
1467
3682
198
3528
41
30094
32
855
1467
3559
198
40
32886
85
65
9861
73
57
48
855
1467
2598
198
3528
12337
66
39
3629
35904
855
1467
2231
198
40
39
57
75
31522
44
28
1467
3510
198
65
13381
1467
2857
198
67
54
57
76
1467
2780
198
5064
4598
57
54
19
28
1467
2920
198
40
39
45
30094
32
855
1467
1120
198
64
18564
23160
86
855
1467
4349
198
65
31212
28
1467
4309
198
64
55
45
85
35904
855
1467
4310
198
40
39
45
16
11215
52
28
1467
4051
198
57
17
2290
1467
2816
198
3528
37
86
66
37094
71
66
70
855
1467
3980
198
3528
42372
57
17
71
15
1467
3553
198
3528
53
89
1467
3365
198
65
17
56
28
1467
3270
198
40
39
67
31298
37094
88
1467
1899
198
40
17184
40842
54
53
89
1467
5333
198
20475
3829
1467
5237
198
3528
9892
65
18
66
28
1467
5066
198
16284
85
65
55
33
71
9374
74
28
1467
2414
198
5064
49
75
1467
2996
198
65
18
67
89
1467
2791
198
3528
16
71
66
70
855
1467
3134
198
65
18
53
88
56
17
52
28
1467
3104
198
64
54
24
82
1467
3388
198
56
55
41
83
1467
2154
198
56
77
40
28
1467
4869
198
3528
53
19
56
54
16
39346
38022
28
1467
4761
198
16284
85
20475
44
28
1467
4790
198
3528
57
85
11215
52
28
1467
4524
198
5064
49
85
1467
2425
198
66
39
41
85
1467
4304
198
49
52
19
28
1467
3324
198
11215
297
66
86
855
1467
3695
198
2389
40
16
1467
3720
198
40
1677
71
35904
855
1467
1795
198
20475
53
20
1467
6659
198
3528
37
73
67
39
53
71
65
38
87
20
1467
6469
198
3528
53
17
40692
40
28
1467
5999
198
67
55
41
30094
39
74
28
1467
5705
198
56
54
83
23160
70
855
1467
5332
198
56
55
33
89
1467
4521
198
40
17184
258
32
855
1467
5774
198
3528
16
2763
24
88
1467
3459
198
56
54
16
71
1467
4531
198
3528
24
9132
37094
84
1467
3829
198
40692
41
71
65
32
855
1467
6420
198
3528
71
16
65
54
41133
1467
5892
198
3528
79
85
56
70
855
1467
6052
198
64
55
45
15
40692
40
28
1467
5824
198
3528
37
17
56
54
7278
56
54
49044
57
48
855
1467
3865
198
65
17
45
88
1467
4846
198
57
54
20
84
1467
5607
198
56
54
75
74
1467
4089
198
64
55
57
79
34892
855
1467
2079
198
40
39
41
75
56
1959
88
34892
855
35665
198
20519
40
28
1596
486
198
40
39
45
79
20475
66
28
1596
2999
198
10008
37
83
1596
3070
198
64
18564
75
20475
45
75
1596
3023
198
3528
20
335
18
44
28
1596
2713
198
66
18
49
44601
70
855
1596
3312
198
3528
53
73
65
1495
85
65
48
855
1596
2998
198
3528
57
85
65
38
87
20306
17
2290
57
86
855
1596
2919
198
10008
41
88
1596
2931
198
64
55
45
79
20475
66
28
1596
940
198
3528
71
20306
55
40
28
1596
1157
198
65
54
24
89
67
32
855
1596
1065
198
67
54
16
75
9374
48
28
1596
1485
198
40
39
45
293
32
855
1596
1415
198
3528
49
44601
17
44
28
1596
1314
198
3528
41
75
56
1959
83
57
48
855
1596
1433
198
10008
53
74
1596
1558
198
40
17184
85
65
17
82
28
1596
1507
198
3528
12337
36020
2290
57
86
855
1596
1129
198
40
39
3886
65
17
49
16
56
18
48
28
1596
1238
198
56
55
53
21282
32
855
1596
2481
198
48
37643
28
1596
1828
198
56
55
41
79
20475
66
28
1596
1954
198
3528
16
75
56
54
20
89
1596
1731
198
