63050
419
220
15
198
40
70
419
220
16
198
40
86
419
220
17
198
45280
419
220
18
198
41
48
419
220
19
198
41
70
419
220
20
198
41
86
419
220
21
198
27542
419
220
22
198
42
48
419
220
23
198
42
70
419
220
24
198
42
86
419
220
605
198
18326
419
220
806
198
43
48
419
220
717
198
43
70
419
220
1032
198
43
86
419
220
975
198
4940
419
220
868
198
36269
419
220
845
198
44
70
419
220
1114
198
44
86
419
220
972
198
7476
419
220
777
198
45
48
419
220
508
198
21567
419
220
1691
198
45
86
419
220
1313
198
42439
419
220
1419
198
46
48
419
220
1187
198
46
70
419
220
914
198
46
86
419
220
1627
198
8201
419
220
1544
198
47
48
419
220
1591
198
83640
419
220
1682
198
47
86
419
220
966
198
48622
419
220
2148
198
49126
419
220
843
198
48
70
419
220
1644
198
48
86
419
220
1958
198
5726
419
220
1758
198
49
48
419
220
1927
198
49
70
419
220
1806
198
49
86
419
220
1987
198
7934
419
220
2137
198
65408
419
220
1272
198
50
70
419
220
3174
198
13521
419
220
2983
198
15559
419
220
3391
198
51
48
419
220
2096
198
51
70
419
220
1774
198
23662
419
220
2790
198
18258
419
220
2618
198
52
48
419
220
2166
198
52
70
419
220
2491
198
52
86
419
220
1135
198
13114
419
220
3971
198
53
48
419
220
4103
198
53
70
419
220
4331
198
53
86
419
220
4370
198
27486
419
220
2131
198
54
48
419
220
3487
198
54
70
419
220
3226
198
54
86
419
220
2970
198
60550
419
220
2946
198
55
48
419
220
1399
198
55
70
419
220
5547
198
55
86
419
220
5538
198
87582
419
220
5495
198
56
48
419
220
1227
198
56
70
419
220
2397
198
56
86
419
220
2287
198
53436
419
220
3080
198
57
48
419
220
2614
198
57
70
419
220
3076
198
57
86
419
220
2031
198
64
32
419
220
6028
198
64
48
419
220
5332
198
351
419
220
5958
198
675
419
220
5728
198
65
32
419
220
2075
198
65
48
419
220
4767
198
12498
419
220
2813
198
40924
419
220
2495
198
66
32
419
220
4643
198
66
48
419
220
1490
198
28546
419
220
5932
198
63643
419
220
6086
198
67
32
419
220
6069
198
67
48
419
220
5833
198
36238
419
220
5313
198
30506
419
220
4218
198
68
32
419
220
4044
198
68
48
419
220
2421
198
797
419
220
4578
198
365
419
220
1954
198
69
32
419
220
5925
198
69
48
419
220
6083
198
4922
419
220
6365
198
78
48
419
220
6281
198
540
419
220
2721
198
363
419
220
4161
198
79
32
419
220
3534
198
79
48
419
220
3264
198
3601
419
220
1484
198
32962
419
220
1041
198
80
32
419
220
4645
198
80
48
419
220
4278
198
80
70
419
220
6889
198
70391
419
220
6849
198
81
32
419
220
6550
198
2026
419
220
7461
198
32868
419
220
7699
198
82
32
419
220
6640
198
82
48
419
220
7743
198
2034
419
220
5120
198
2332
419
220
5037
198
83
32
419
220
7261
198
83
48
419
220
8190
198
42528
419
220
8011
198
15930
419
220
7322
198
84
32
419
220
8027
198
84
48
419
220
8546
198
773
419
220
8899
198
43210
419
220
9079
198
85
32
419
220
4364
198
85
48
419
220
7994
198
7387
419
220
8259
198
35531
419
220
4513
198
86
32
419
220
8874
198
86
48
419
220
6549
198
46640
419
220
9390
198
1273
419
220
6804
198
15015
419
220
4386
198
87
48
419
220
9748
198
87
70
419
220
5894
198
87
86
419
220
9263
198
88
32
419
220
9413
198
88
48
419
220
9423
198
49865
419
220
9565
198
85514
419
220
8878
198
89
32
419
220
9795
198
89
48
419
220
10148
198
89
70
419
220
10350
198
31881
419
220
10125
198
15
32
419
220
6860
198
15
48
419
220
9335
198
15
70
419
220
10239
198
15
86
419
220
10290
198
16
32
419
220
8929
198
16
48
419
220
9591
198
16
70
419
220
10465
198
16
86
419
220
10288
198
17
32
419
220
10410
198
17
48
419
220
10161
198
17
70
419
220
3965
198
17
86
419
220
9690
198
18
32
419
220
9756
198
18
48
419
220
9800
198
18
70
419
220
10559
198
18
86
419
220
9992
198
19
32
419
220
10132
198
19
48
419
220
10895
198
19
70
419
220
11286
198
19
86
419
220
11068
198
20
32
419
220
6330
198
20
48
419
220
10718
198
20
70
419
220
10674
198
20
86
419
220
9892
198
21
32
419
220
10513
198
21
48
419
220
10680
198
21
70
419
220
11247
198
21
86
419
220
11515
198
22
32
419
220
8953
198
22
48
419
220
11739
198
22
70
419
220
8258
198
22
86
419
220
11123
198
23
32
419
220
10861
198
23
48
419
220
11908
198
23
70
419
220
11771
198
23
86
419
220
10005
198
24
32
419
220
10967
198
24
48
419
220
11242
198
24
70
419
220
11256
198
24
86
419
220
11128
198
93580
419
220
5245
198
10
48
419
220
10562
198
10
70
419
220
10828
198
66205
419
220
10750
198
10576
419
220
10336
198
46374
419
220
9741
198
4951
419
220
9714
198
6458
419
220
9674
198
6157
419
220
9367
198
93173
419
220
9378
198
9219
419
220
7028
198
23422
419
220
7529
198
7209
419
220
5926
198
33
48
419
220
7285
198
49937
419
220
6393
198
33
86
419
220
6280
198
5158
419
220
5162
198
34
48
419
220
4468
198
34
70
419
220
3753
198
34
86
419
220
2550
198
6486
419
220
1049
198
35
48
419
220
679
198
35
70
419
220
2366
198
35
86
419
220
9639
198
19657
419
220
7854
198
55107
419
220
10866
198
36
70
419
220
11056
198
36
86
419
220
12060
198
3711
419
220
12171
198
37
48
419
220
12652
198
37
70
419
220
8848
198
37
86
419
220
11483
198
16519
419
220
11227
198
38
48
419
220
11702
198
38
70
419
220
11584
198
38
86
419
220
12112
198
17455
419
220
12463
198
90719
419
220
13460
198
39
70
419
220
13302
198
39
86
419
220
13762
198
5987
419
220
8610
198
21206
419
220
12425
198
70
32
419
220
9716
198
70
48
419
220
12533
198
14736
419
220
10697
198
55233
419
220
11057
198
71
32
419
220
14057
198
71
48
419
220
14206
198
67702
419
220
14261
198
28927
419
220
14378
198
72
32
419
220
9870
198
72
48
419
220
12245
198
343
419
220
12338
198
38181
419
220
12994
198
73
32
419
220
11727
198
73
48
419
220
12422
198
73
70
419
220
14087
198
73
86
419
220
14590
198
74
32
419
220
13895
198
74
48
419
220
14815
198
7501
419
220
8273
198
29700
419
220
13341
198
75
32
419
220
12754
198
75
48
419
220
14052
198
12082
419
220
13719
198
58153
419
220
13078
198
70365
419
220
14205
198
76
48
419
220
14125
198
12591
419
220
14185
198
45228
419
220
14735
198
77
32
419
220
5154
198
77
48
419
220
13860
198
983
419
220
12326
198
62327
419
220
14022
198
78
32
419
220
12375
198
81
48
419
220
3192
198
76123
48
28
220
4146
198
1953
36
28
220
15574
198
64
55795
28
220
15966
198
64
54
19
28
220
15537
198
6358
52
28
220
11387
198
65
1187
28
220
15602
198
40
17526
78
57
48
419
220
14274
198
81823
40
28
220
15666
198
40
53248
28
220
12815
198
56
55
48
28
220
14374
198
76123
66
28
220
15999
198
1953
23
28
220
16567
198
82856
19
28
220
16332
198
1953
44
28
220
16955
198
64
55
48
28
220
10914
198
64
53437
28
220
15828
198
99217
19
28
220
15741
198
65
18
40
28
220
15451
198
57
53437
28
220
16590
198
1953
40
28
220
14417
198
82856
48
28
220
16660
198
1953
56
28
220
16367
198
64
54
20
77
220
16949
198
40
17455
28
220
17267
198
65
18
52
28
220
11209
198
1953
77845
220
15282
198
99217
86
28
220
16544
198
56
84214
28
220
16085
198
40
17526
85
220
17058
198
1953
15
28
220
15935
198
1953
24
76
220
17361
198
1953
10036
220
17897
198
1953
48
28
220
15287
198
1953
70
28
220
17212
198
1953
77845
53436
419
220
13754
198
64
15565
28
220
17335
198
56
53437
28
220
16443
198
65
55795
28
220
17313
198
40
17526
78
220
17168
198
64
54
24
84
220
16780
198
65
508
28
220
17408
198
65
38
86
28
220
18163
198
82856
1135
220
17690
198
1953
19
28
220
15531
198
1953
86
28
220
3101
198
66
18
48
28
220
12405
198
76123
41
75
220
13121
198
14170
52
28
220
13236
198
1953
52
28
220
12166
198
6358
23
28
220
13364
198
65
39
74
28
220
12879
198
1953
41
75
220
14777
198
1953
66
28
220
14498
198
2843
48
28
220
15500
198
56
18
48
28
220
12226
198
2843
44
28
220
15134
198
64
54
48
28
220
13384
198
65
18
48
28
220
15231
198
5484
74
28
220
16104
198
67
55
48
28
220
15189
198
81823
48
28
220
15340
198
5484
36
28
220
16718
198
1953
96605
220
17592
198
1953
24
84
220
16874
198
64
54
15
28
220
9588
198
99217
15
28
220
14423
198
65
18
66
28
220
15805
198
56
55
74
28
220
15726
198
99217
48
28
220
16723
198
66
17
52
28
220
15257
198
40
17526
78
56
55
48
28
220
17470
198
40
2783
28
220
13817
198
64
54
66
28
220
16884
198
1953
57
7513
70
419
220
18196
198
56
15565
28
220
10568
198
76123
74
28
220
16707
198
14170
93697
220
17079
198
67
84214
28
220
8765
198
76123
52
28
220
17153
198
65
38
48
28
220
16596
198
40
44265
15
220
17014
198
5484
15
28
220
17609
198
41
18
44
28
220
18633
198
1953
18442
220
17887
198
1953
75
15
220
13679
198
56
53921
17063
1187
28
220
16546
198
64
55
39972
220
17590
198
64
84214
28
220
16522
198
56
17
52
28
220
17451
198
76123
75
17008
48
419
220
12901
198
64
54
86
28
220
18061
198
5484
40
28
220
17678
198
76123
3055
220
19746
198
65
17
86
28
220
18634
198
38615
28
220
8652
198
76123
9996
67
38
70
28
220
18113
198
12420
28
220
16482
198
67
40818
88
220
17228
198
56
17
70
28
220
18384
198
1953
37
89
220
17306
198
76123
8910
220
18349
198
1341
70
28
220
18520
198
30407
48
28
220
17112
198
64
54
19072
220
19192
198
5484
48
28
220
6843
198
64
54
56
28
220
18277
198
33372
28
220
18509
198
99217
66
28
220
18199
198
81823
41
89
220
15951
198
64
17
52
28
220
12676
198
75176
28
220
18044
198
5484
70
28
220
18775
198
82856
15
28
220
19057
198
6399
85
12498
419
220
19929
198
2843
66
28
220
14648
198
35088
28
220
18650
198
64
40818
88
220
17662
198
76123
31721
63643
419
220
18017
198
40
24860
28
220
18265
198
65
17
48
28
220
12935
198
5484
56
28
220
18322
198
67
54
86
28
220
10898
198
56
53921
75
220
19166
198
1953
37
15
220
19867
198
6358
74
28
220
13897
198
66
17455
28
220
19162
198
65
18
41
75
220
18781
198
2843
39972
57
48
419
220
19230
198
40
44265
75
220
12910
198
67
53437
28
220
18695
198
76123
1383
40924
419
220
16481
198
1953
20990
220
20062
198
67
54
15
28
220
19081
198
1953
37
88
57
48
419
220
20422
198
1953
49
75
220
15515
198
99217
10036
220
19631
198
99217
20
74
220
19695
198
1953
24
88
220
18252
198
64
54
3055
220
20077
198
81823
45
15
220
19498
198
64
55
45
15
220
19615
198
56
61295
28
220
20698
198
6358
24
83
220
19838
198
5484
19
28
220
18572
198
67
38
70
28
220
3443
198
6399
43505
48
419
220
10841
198
5484
66
28
220
16496
198
67
54
19
28
220
13074
198
65
18
32
28
220
7507
198
6204
32
28
220
16408
198
5484
86
28
220
17264
198
1953
20
17008
32
419
220
18501
198
81823
45
89
220
18058
198
1953
53
19
220
12378
198
40
49952
28
220
14487
198
6358
53
89
220
17337
198
5484
52
28
220
17574
198
81823
66
28
220
19288
198
64
53921
20
220
17448
198
99217
1135
220
18136
198
1953
41
20
220
17763
198
82856
86
28
220
19561
198
65
18
44
28
220
19770
198
65
18
41
15
220
19391
198
65
17
44
28
220
12819
198
66
55
52
28
220
18245
198
1953
57
85407
508
28
220
16460
198
1953
20990
14170
52
28
220
19711
198
40
44265
16
220
18517
198
64
55
57
75
220
17837
198
65
18
52837
53436
419
220
20363
198
76123
2822
220
20465
198
40
17526
20103
53437
28
220
19140
198
11328
48
28
220
16371
198
6358
36
28
220
14245
198
66
55795
28
220
19852
198
64
54
67
347
32
419
220
16739
198
56
55
41
15
220
20153
198
65
54
53
664
32
419
220
20165
198
1953
49400
220
19305
198
67
55
45
15
220
21299
198
82856
20
74
220
18318
198
7416
15
28
220
20596
198
99217
19072
220
20963
198
5484
23
28
220
14868
198
56
38019
81
220
18495
198
1953
2822
220
20502
198
1953
25299
220
17147
198
64
54
53
89
220
14870
198
6358
97179
220
19697
198
56
55
41
74
220
20385
198
19
78
32
28
220
20800
198
65
18
53
15
220
19956
198
5484
78
28
220
21125
198
1953
23550
220
10617
198
57
33231
88
220
20360
198
64
16760
28
220
21098
198
99217
87
325
48
419
220
20235
198
65
18
93697
220
20555
198
65
18
45
15
220
20325
198
57
17
70
28
220
10961
198
66
90719
28
220
21675
198
40
31825
82
220
21209
198
56
55
45
15
220
22094
198
6399
71
12498
419
220
16551
198
56
75833
28
220
19608
198
65
1691
75
220
20911
198
67
54
48
28
220
21290
198
47741
18442
220
21033
198
1953
71
4080
86
419
220
19988
198
1953
49
85
220
21404
198
1953
38361
220
20419
198
1953
20990
63643
419
220
20304
198
57
17
52
28
220
21330
198
41
18
48
28
220
17711
198
2843
52
28
220
20617
198
6358
5925
220
21757
198
40
44265
71
220
21505
198
1953
78
28
220
21358
198
1953
41
16
67
32
419
220
19799
198
76123
67
7513
70
419
220
22191
198
1953
37
17319
32
419
220
21144
198
57
38019
15
220
22086
198
1953
82
28
220
21848
198
99217
16
75
220
11738
198
76123
9996
65
38
86
28
220
21235
198
65
17
82
28
220
21984
198
76123
3055
57
48
419
220
21884
198
40
17526
78
81823
74
28
220
20339
198
64
18408
75
220
19773
198
44
1170
28
220
21511
198
57
76
56
28
220
22184
198
64
54
2822
220
21310
198
66
38
86
28
220
22418
198
67
38
71
17704
70
419
220
18518
198
40
17526
88
220
21824
198
46521
19
28
220
21776
198
1953
75
664
32
419
220
22741
198
64
54
52
28
220
22054
198
67
55
41
75
220
21038
198
99217
8910
220
19447
198
1953
20
75
220
22640
198
64
33231
82
220
21962
198
56
60550
28
220
18162
198
64
54
20
75
220
2636
198
64
38019
75
220
14408
198
1953
16
75
220
17824
198
1953
5925
67
32
419
220
17735
198
99217
20
89
220
18048
198
65
914
75
220
17786
198
65
914
77
220
19673
198
64
54
24
1791
86
419
220
20068
198
76123
52116
86
419
220
19869
198
5484
82
28
220
12448
198
76123
53
86
220
15633
198
40
17526
78
82856
398
220
18625
198
1953
37
74
220
8358
198
926
44
28
220
21164
198
76123
53
89
220
20998
198
56
53921
75
53436
419
220
19633
198
65
18
53
89
220
20571
198
1953
16
85
6358
52
28
220
22507
198
67
54
52
28
220
21312
198
65
17
66
28
220
21851
198
2843
45
15
220
15830
198
64
54
20
74
220
20767
198
64
54
11805
220
20936
198
40
44265
85
220
21123
198
64
54
16
75
220
21177
198
66
40818
88
220
18415
198
46521
40
28
220
22593
198
56
76
93697
220
22369
198
64
55
78
28
220
21458
198
56
38019
15
220
21618
198
1953
24
84
57
48
419
220
17252
198
40
44265
4317
54
48
28
220
20823
198
1341
15
28
220
20711
198
56
55
41
75
220
21876
198
76123
75
17008
84214
28
220
22467
198
56
17
44
28
220
20618
198
2843
39972
220
21600
198
6399
82
220
19038
198
57
60550
28
220
22600
198
99217
11805
220
23033
198
99217
31580
57
48
419
220
17048
198
64
60550
28
220
22058
198
6399
85
11328
48
28
220
21791
198
76123
3055
64
54
2822
220
19642
198
64
12739
28
220
21239
198
1953
4937
220
20749
198
1953
37
581
18
53
15
220
22048
198
76123
8910
6358
52
28
220
23215
198
14170
53
9188
48
419
220
22287
198
67
61295
28
220
22782
198
1953
20990
53436
419
220
13506
198
1953
88242
220
21860
198
6399
43505
60550
28
220
21478
198
8724
40
28
220
22663
198
5484
10036
220
22303
198
76123
88242
220
14148
198
1953
25955
220
20866
198
64
55
41
75
220
23906
198
56
38019
75
220
22895
198
56
55
52
28
220
22424
198
56
55
41
20
220
17698
198
76123
67
17008
54
87
74
220
20460
198
56
55
45
89
220
19242
198
14606
74
28
220
21789
198
3895
27542
220
22210
198
56
17
86
28
220
20943
198
65
1682
81
220
23477
198
81823
41
75
220
19282
198
66
1591
28
220
22049
198
15544
28
220
23642
198
64
54
1072
220
18712
198
64
61295
28
220
22005
198
1953
24
76
57
70
419
220
22468
198
40
17526
75
220
22529
198
14170
88242
220
23402
198
2843
74
28
220
21228
198
64
54
25299
220
20758
198
65
18
45
75
220
23411
198
64
53921
75
220
22915
198
65
18
41
83
220
24847
198
33372
86
36269
419
220
18216
198
76123
41
17704
86
419
220
23864
198
1953
16
71
12498
419
220
23670
198
76123
5028
28546
419
220
23493
198
1953
1954
64
40818
88
220
23816
198
65
18
41
74
220
21535
198
67
54
87
15
220
22345
198
1953
41
75
82856
19
28
220
22159
198
1953
87
6733
17
52
28
220
20691
198
56
55
45
75
220
22905
198
99217
20
73
57
48
419
220
20615
198
64
18
44
28
220
24380
198
56
55
96605
220
20128
198
65
18
1072
220
22608
198
82856
20
73
57
48
419
220
23428
198
1953
61348
86
419
220
22754
198
56
18
49
17063
1187
28
220
24515
198
1953
37
361
48
419
220
24574
198
1953
37
24990
32
419
220
21856
198
40
44265
86
220
21944
198
64
54
1135
220
5067
198
6358
53
36068
86
419
220
18262
198
56
53921
17063
914
89
220
20224
198
99217
4835
220
21006
198
926
48
28
220
20354
198
64
38019
50139
32
419
220
19666
198
40
17526
78
82856
15
28
220
20213
198
1953
71
17704
70
419
220
21996
198
65
18
53
664
32
419
220
19944
198
40
965
78
220
21138
198
1953
37
88
220
17608
198
1953
18244
220
20973
198
40
17526
78
81823
41
75
220
21018
198
76123
5028
220
22922
198
76123
657
56
84214
28
220
22638
198
56
16760
28
220
21385
198
1953
868
220
21379
198
40
44265
43505
54
52
28
220
21717
198
76123
3055
82856
19
28
220
21985
198
65
18
53
3458
32
419
220
23388
198
99217
2822
220
17416
198
40
17526
78
99217
19
28
220
22488
198
14606
52
28
220
19808
198
65
914
74
220
22801
198
64
38019
81
220
23000
198
1953
6083
81823
40
28
220
15894
198
14170
52837
220
22385
198
40
50816
16
220
23103
198
34
3427
28
220
23574
198
40
44265
73
220
24239
198
6358
53
16373
32
419
220
18660
198
6358
53
75
220
21729
198
5484
75
15
220
20775
198
65
18
88242
53436
419
220
23736
198
66
38
24
41221
32
419
220
24307
198
1953
37
2445
1591
28
220
22276
198
40
31825
71
14606
48
28
220
22422
198
57
77
49
17704
70
419
220
21788
198
1953
25506
220
24495
198
1953
41
75
56
86
419
220
23079
198
40
17526
17063
54
52
28
220
14033
198
82856
20
89
220
23525
198
926
52
28
220
22266
198
65
18
75307
57
48
419
220
22956
198
76123
3055
56
55
48
28
220
21975
198
1953
20
85
220
22926
198
57
89114
28
220
22642
198
65
54
93697
220
22644
198
99217
20
77
220
23802
198
1953
20
509
86
419
220
24734
198
7416
15
83
43
48
419
220
13655
198
1953
67
509
32
419
220
23409
198
65
18
41
20
220
23181
198
64
53921
17063
1187
28
220
21598
198
64
54
20
1031
86
419
220
21969
198
1953
79
16
66
18
48
28
220
15573
198
1953
75
664
38
23
28
220
20744
198
52271
28
220
23480
198
82856
1135
63643
419
220
23654
198
65
18
57
75
220
25090
198
67
55795
28
220
19274
198
76123
5028
65
18
75307
57
48
419
220
24132
198
76123
1383
57
48
419
220
24199
198
1953
75
15
63643
419
220
24491
198
76123
41
75
56
86
419
220
23888
198
40
17526
18
220
23467
198
64
33231
84
220
10943
198
64
55
41
49755
32
419
220
19774
198
56
55
41
81
220
24427
198
65
18
41
89
220
25289
198
76123
67
7513
1026
28
220
21218
198
56
18408
75
220
23403
198
65
17
40
28
220
22768
198
76123
2822
57
48
419
220
24938
198
1953
5925
28546
419
220
25513
198
67
1187
28
220
21129
198
64
54
20
81
220
24187
198
65
32641
73
220
24375
198
12420
20
220
17458
198
5484
18442
220
25136
198
64
55
2822
220
17814
198
30407
49
17704
70
419
220
25091
198
56
55
53
89
57
48
419
220
25178
198
1953
71
17063
48
419
220
24887
198
65
914
89
220
24313
198
2843
82
28
220
23717
198
76123
41
85
220
22347
198
57
76
24
85407
48
419
220
21897
198
64
54
87
74
220
23292
198
56
53921
17704
86
419
220
25458
198
14170
53
3418
86
419
220
21741
198
1953
24
392
39
74
28
220
25168
198
65
17
19072
220
25073
198
40
44265
86
57
48
419
220
25298
198
56
17
82
28
220
25392
198
82856
19072
220
24394
198
99217
16
86
220
23578
198
1953
37
73
56
86
419
220
25388
198
1953
31580
220
25169
198
64
54
5925
63643
419
220
23459
198
67
55
63704
220
7007
198
57
77
48
28
220
19597
198
65
1682
74
220
20253
198
1953
71
17008
86
419
220
20436
198
64
40818
74
220
21949
198
1341
66
28
220
21469
198
1953
37
2329
40818
88
220
22457
198
56
55
66
28
220
18770
198
1953
37
15
67
32
419
220
21295
198
65
18
56
28
220
22874
198
30407
52
28
220
19027
198
40
31825
82
56
55
74
28
220
22375
198
81823
41
17
220
22708
198
64
38019
15
220
22977
198
6399
17008
54
87
74
220
23193
198
64
53921
15
220
22744
198
1953
37
83
220
23929
198
1953
57
4080
77
45
15
220
25150
198
926
56
28
220
21982
198
1953
37
44490
32
419
220
24758
198
1341
48
28
220
13104
198
57
15565
28
220
20873
198
64
38
10036
57
86
419
220
23024
198
67
33231
82
220
24388
198
67
54
19072
220
24735
198
6399
43505
54
15
28
220
23309
198
65
18
74
28
220
24430
198
65
17
87
74
220
23486
198
56
17
53
89
220
24054
198
56
53921
17704
70
419
220
22194
198
1953
57
75
220
20785
198
1953
41
509
32
419
220
24626
198
67
17
52
28
220
24289
198
64
54
57
76
220
24865
198
40
17526
18
40924
419
220
24438
198
65
17
62052
220
24939
198
1953
41
71
56
17
82
28
220
23969
198
41549
19
28
220
22039
198
64
18408
75
11328
48
28
220
25527
198
76123
88242
57
40818
88
220
25809
198
6358
5925
57
17
70
28
220
21112
198
66
17
52837
220
25021
198
68
90719
28
220
25560
198
1953
16
383
48
419
220
26260
198
6358
5925
30407
48
28
220
23800
198
40
31825
85
220
23901
198
66
38
70
28
220
25594
198
64
55
45
89
220
23619
198
1953
49
17704
86
419
220
20338
198
1953
16
7513
18
48
28
220
25541
198
1953
62830
53436
419
220
11711
198
1953
37
74
53436
419
220
23986
198
309
53
44490
32
419
220
23644
198
1953
10036
56
86
419
220
25504
198
57
76
24
88
57
48
419
220
23952
198
40
31825
43505
32
419
220
23532
198
65
5154
220
24456
198
1953
25955
99217
10036
220
23776
198
56
17
87
16
53436
419
220
25302
198
67
40818
88
12498
419
220
26439
198
1953
83
392
18
66
28
220
19104
198
1953
20
75
82856
48
28
220
25110
198
6399
85
11328
44
28
220
24376
198
6399
85
220
26083
198
1341
19
28
220
24402
198
76123
31721
11328
48
28
220
22240
198
40
44265
75
57
48
419
220
25358
198
926
66
28
220
23275
198
65
1029
84
57
86
419
220
17521
198
64
54
53
18
220
24619
198
2843
49
20103
53437
28
220
20772
198
56
17
97179
220
24876
198
1953
53
17
82856
19
28
220
23624
198
1953
10036
53436
419
220
23267
198
67
39
74
28
220
24472
198
2843
8910
220
22908
198
56
55
39972
220
23823
198
40
17526
78
81823
45
75
220
15831
198
76123
1383
220
23592
198
76123
53
89
57
48
419
220
25659
198
1953
41
75
56
17
37
16
66
17
52
28
220
19423
198
1953
57
82
220
21893
198
65
13183
28
220
23833
198
1953
20
17008
86
419
220
26008
198
3895
27542
29700
419
220
22148
198
56
1682
83
220
22539
198
64
55
45
75
220
25251
198
1953
16
4317
17
52
28
220
23171
198
40
17526
78
82856
19
28
220
24216
198
65
18
8910
28546
419
220
16474
198
1953
53
17
81823
41
20
220
22876
198
2843
88242
220
26234
198
40
44265
75
56
86
419
220
24763
198
65
18
45
89
220
24531
198
67
54
2822
220
25926
198
1953
53
83
220
25808
198
926
15
28
220
24832
198
2843
41
75
220
25314
198
64
54
97179
220
26519
198
66
1029
15
220
23987
198
1953
75
664
70
419
220
4728
198
65
40818
44490
32
419
220
17973
198
40
44265
16
66
17455
28
220
13135
198
56
53921
17063
13183
28
220
20899
198
1953
87
43505
17
82
28
220
20417
198
65
33231
84
220
21032
198
66
40818
44490
32
419
220
22397
198
926
70
28
220
23178
198
6358
6365
220
11770
198
1953
41
16
220
21474
198
76123
3055
81823
41
75
220
19232
198
64
54
57
79
56
86
419
220
22588
198
76123
657
56
55
41
89
220
19270
198
64
54
87
20
220
24288
198
1953
62830
57
76
56
28
220
25498
198
40
44265
677
18
52837
53436
419
220
23582
198
76123
41
21807
48
419
220
23713
198
47741
70
28
220
25528
198
17268
19
28
220
23141
198
1953
53
17
220
18831
198
57
37432
20
220
18248
198
41
18
41
75
220
23282
198
6358
747
220
23105
198
76123
41
21807
32
419
220
23848
198
66
18
44
28
220
25016
198
1953
49
75
57
70
419
220
22091
198
76123
41
79
57
17
71
15
220
23038
198
40
44265
20
220
24920
198
42
13521
28
220
22716
198
65
40818
89
220
26218
198
6204
23422
220
21221
198
64
40818
84
220
25009
198
40
17526
511
76
5925
57
17
70
28
220
23879
198
2843
49
88
220
22904
198
55
972
28
220
26223
198
76123
67
383
48
419
220
23424
198
1953
49
85
12498
419
220
25192
198
1341
86
28
220
26244
198
12420
86
220
24250
198
56
55
45
75
53436
419
220
25465
198
1953
37
36068
86
419
220
19899
198
67
54
41
9258
15565
28
220
25496
198
76123
41
75
57
86
419
220
25377
198
5484
77845
53436
419
220
23996
198
64
55
70
28
220
24344
198
40
62859
75
14606
74
28
220
24650
198
1953
10036
56
17
87
16
53436
419
220
26563
198
65
18
39972
81823
40
28
220
25125
198
1953
4937
66
32
419
220
24951
198
65
18
39972
220
26537
198
40
44265
16
56
70
419
220
16217
198
3895
42
2149
32
419
220
24866
198
1953
41
4355
54
20
77
220
24571
198
56
55
41
77
220
25724
198
2843
3055
220
25515
198
2898
15
28
220
22869
198
64
54
31580
57
48
419
220
25505
198
1953
49
85
57
53437
28
220
20907
198
99217
20
77
57
48
419
220
23805
198
6358
37
83
220
24061
198
926
74
28
220
18670
198
81823
41
15
220
24963
198
66
53248
28
220
24071
198
64
53921
75
53436
419
220
26051
198
56
53921
17063
914
50139
32
419
220
19355
198
1953
41
88
220
24678
198
1953
49
17008
1187
28
220
22455
198
1953
16
71
11328
74
28
220
26013
198
99217
796
65
13183
28
220
25862
198
6399
50139
38
86
28
220
26497
198
67
55
41
17063
13183
28
220
22440
198
64
53921
79
57
53437
28
220
25665
198
76123
1255
220
25303
198
64
38019
89
220
25747
198
99217
94055
220
25822
198
1953
49
75
56
86
419
220
17419
198
56
53921
79
14170
52
28
220
24870
198
82856
20
17704
70
419
220
23873
198
1953
41
75
57
76
24
88
57
48
419
220
25890
198
64
54
87
15720
39
74
28
220
25622
198
76123
8910
65
38
86
28
220
19272
198
1953
806
56
17
70
28
220
25339
198
81823
41
26397
1187
28
220
23213
198
76123
14804
18
45
75
220
24902
198
40
44265
16
56
17
70
28
220
25962
198
1953
11805
220
19445
198
1953
88242
53436
419
220
25399
198
5484
41
16
67
32
419
220
26058
198
56
55
45
85
12498
419
220
12251
198
67
38
10036
57
86
419
220
25354
198
1953
87
43505
13183
28
220
21381
198
82856
56
28
220
24962
198
40
17526
20103
54
20
81
220
24110
198
68
53437
28
220
26088
198
1953
41
21807
32
419
220
26227
198
40
44265
83
220
25238
198
64
53921
89
220
24542
198
56
55
70
28
220
24777
198
1953
6365
12498
419
220
24809
198
76123
1383
65
18
56
28
220
22889
198
40
44265
509
32
419
220
7467
198
64
54
57
75
220
19319
198
65
54
53
664
53248
28
220
21026
198
56
18577
75
220
23305
198
67
17
37
88
53436
419
220
22777
198
40
44265
677
18
66
28
220
22393
198
76123
1383
57
53437
28
220
22224
198
65
53437
28
220
23505
198
65
1691
509
32
419
220
23629
198
1953
24
72
220
21278
198
40
44265
383
48
419
220
21056
198
2843
2822
220
17000
198
67
53248
28
220
22750
198
57
77
52837
220
24331
198
1953
89224
57
70
419
220
24579
198
1953
67
16
220
22387
198
1953
75
1791
18
48
28
220
24487
198
67
54
20
74
220
24391
198
6358
88242
220
25828
198
56
17
53
36068
86
419
220
24337
198
1953
53
664
32
419
220
18485
198
2843
75
17008
48
419
220
22536
198
1953
38361
65
17
48
28
220
20275
198
40
44265
15
56
55
41
15
220
22614
198
64
54
20
73
57
48
419
220
23890
198
1953
16
71
57
55795
28
220
21910
198
67
90719
28
220
26026
198
66
18
49
21807
48
419
220
26437
198
65
17
87
85
57
86
419
220
25001
198
67
60550
28
220
25344
198
76123
86
28
220
19306
198
67
54
16
86
220
25717
198
1953
18442
65
32
419
220
25401
198
14170
93697
12498
419
220
25806
198
67
54
87
71
28546
419
220
24347
198
67
33231
17319
39
74
28
220
26970
198
1953
37
73
220
25612
198
1953
16
85
12498
419
220
21936
198
1953
87
39152
18
48
28
220
25454
198
33372
86
4940
419
220
26164
198
8673
32
28
220
21251
198
40
44265
15
67
54
48
28
220
21322
198
67
55
41
17704
86
419
220
20249
198
5484
37
88
220
26576
198
66
17
52837
57
70
419
220
25687
198
56
55
41
89
220
24599
198
65
54
53
7911
15565
28
220
26491
198
67
54
53
89
220
26511
198
56
18
74
28
220
26979
198
1953
16
79
12498
419
220
24680
198
65
17
87
17319
18
66
28
220
15862
198
6399
43505
32
419
220
24989
198
64
54
23
28
220
24597
198
1953
16
85
53436
419
220
25326
198
6399
17008
54
1135
220
25741
198
40
965
43505
48
419
220
25875
198
64
40818
89
220
26067
198
1953
57
79
12498
419
220
27341
198
99217
398
220
27079
198
64
54
93697
220
26328
198
19
78
17218
220
16415
198
6358
53
71
53436
419
220
26114
198
99217
20
81
220
26366
198
56
53921
5697
32
419
220
26087
198
81823
57
17704
70
419
220
26281
198
40
44265
15
28546
419
220
24837
198
40
31825
6723
54
1135
220
25285
198
65
18
41
81
220
27134
198
5484
20
509
86
419
220
23386
198
40
44265
16
28546
419
220
24792
198
65
1682
82
220
21133
198
99217
52097
220
25693
198
82856
16
75
11328
48
28
220
24425
198
76123
53
89
82856
48
28
220
24471
198
6358
37
44490
32
419
220
26007
198
67
17
53
75
12498
419
220
24609
198
40
44265
50139
54
52
28
220
25208
198
65
18
88242
220
26409
198
5484
49400
220
17272
198
56
17
74
28
220
25476
198
1953
62830
57
76
57
75
6358
52
28
220
19068
198
76123
3055
64
54
25299
220
25643
198
7416
15
83
7416
15
83
7416
15
28
220
25873
198
1953
31721
65
54
52
28
220
24742
198
56
17
53
6511
32
419
220
23812
198
40
44265
17063
48
419
220
24961
198
46521
19
84
220
27468
198
1953
75
664
40818
88
220
22207
198
57
75833
28
220
24538
198
76123
41
17704
38
24
41221
32
419
220
25350
198
76123
1383
65
17
49
16
220
19146
198
40
44265
15
64
54
19072
220
24606
198
65
40818
74
220
22992
198
99217
70
28
220
24242
198
1953
18442
6358
52
28
220
22897
198
76123
38361
6358
87
74
220
22101
198
76123
14804
18
53
3458
32
419
220
23031
198
1953
3971
65
48
419
220
22694
198
56
55
41
5697
32
419
220
19416
198
64
54
16
17704
86
419
220
5500
198
99217
25299
220
1041
15
198
2843
45
75
220
1041
16
198
5484
18244
220
1041
17
198
48412
23
28
220
1041
18
198
40
849
75
220
1041
19
198
76123
41
509
32
419
220
1041
20
198
76123
41
75
57
70
419
220
1041
21
198
40
17526
88
99217
20
89
220
1041
22
198
30407
93697
220
1041
23
198
67
53921
17063
1187
28
220
1041
24
198
67
40818
3418
86
419
220
4645
15
198
40
17526
4317
17
52
28
220
4645
16
198
40
965
82
220
4645
17
198
6399
85
30407
56
28
220
4645
18
198
67
17
37
20
220
4645
19
198
56
55
57
75
220
4645
20
198
1953
67
6723
54
20
77
220
4645
21
198
40
44265
82
220
4645
22
198
67
54
66
28
220
4645
23
198
5484
37
83
81823
41
79
56
86
419
220
4645
24
198
40
44265
86
57
15565
28
220
4278
15
198
1953
20990
30407
48
28
220
4278
16
198
1953
41
509
39
8910
82856
19
28
220
4278
17
198
64
55
45
15
63643
419
220
4278
18
198
16688
75
220
4278
19
198
65
13754
220
4278
20
198
91588
48
28
220
4278
21
198
1953
53
71
28546
419
220
4278
22
198
1953
25955
99217
75
1791
18
48
28
220
4278
23
198
1953
21888
57
17
70
28
220
4278
24
198
57
17
77845
220
6889
15
198
56
55
78
28
220
6889
16
198
56
55
39972
81823
40
28
220
6889
17
198
1953
53
19
66
32
419
220
6889
18
198
1953
24
86
220
6889
19
198
1953
75
1791
86
419
220
6889
20
198
1953
10470
220
6889
21
198
1953
18442
65
17455
28
220
6889
22
198
76123
41
17704
55
52
28
220
6889
23
198
57
53921
89
220
6889
24
198
64
54
20
89
220
6849
15
198
2843
1383
40924
419
220
6849
16
198
64
55
45
83
220
6849
17
198
1953
57
17008
54
20
74
220
6849
18
198
65
37432
84
53436
419
220
6849
19
198
56
53921
71
220
6849
20
198
67
55
45
89
220
6849
21
198
99217
16
17704
86
419
220
6849
22
198
76123
5028
14606
45
85
12498
419
220
6849
23
198
1953
10470
57
33231
15
220
6849
24
198
66
24860
28
220
6550
15
198
40
44265
79
57
1187
28
220
6550
16
198
5484
77845
220
6550
17
198
41
18
57
75
220
6550
18
198
40
44265
43505
54
53
15
220
6550
19
198
40
44265
17704
70
419
220
6550
20
198
64
32641
86
220
6550
21
198
76123
41
16
12498
419
220
6550
22
198
926
78
28
220
6550
23
198
40
17526
17704
70
419
220
6550
24
198
64
55
41
75
56
18
48
28
220
7461
15
198
1953
57
43505
38
87
17008
86
419
220
7461
16
198
1953
49
509
32
419
220
7461
17
198
64
38019
17704
86
419
220
7461
18
198
1953
57
17063
76
48
28
220
7461
19
198
8673
40
28
220
7461
20
198
1953
16
21807
48
419
220
7461
21
198
6399
88
220
7461
22
198
81823
41
75
53436
419
220
7461
23
198
81823
70
28
220
7461
24
198
1953
53
19
67
32
419
220
7699
15
198
67
55
39972
220
7699
16
198
82856
20
89
57
48
419
220
7699
17
198
56
1591
28
220
7699
18
198
40
17526
75
99217
15
28
220
7699
19
198
67
1029
84
57
86
419
220
7699
20
198
65
18
53
89
57
48
419
220
7699
21
198
56
55
2822
220
7699
22
198
56
53921
15
220
7699
23
198
14170
97179
220
7699
24
198
40
44265
20
66
18
49
21807
48
419
220
6640
15
198
5484
37
89
220
6640
16
198
57
40818
88
220
6640
17
198
64
55
57
17704
86
419
220
6640
18
198
65
54
10036
220
6640
19
198
1953
25299
99217
48
28
220
6640
20
198
5484
31580
220
6640
21
198
56
17
53
664
32
419
220
6640
22
198
1953
37
85407
18
88242
53436
419
220
6640
23
198
1953
38361
14170
93697
12498
419
220
6640
24
198
6399
16
28546
419
220
7743
15
198
14170
53
17319
18
32
28
220
7743
16
198
99217
2131
220
7743
17
198
6399
17008
84214
28
220
7743
18
198
99217
87
15
64
32
419
220
7743
19
198
99217
8910
63643
419
220
7743
20
198
64
55
501
220
7743
21
198
6399
71
28546
419
220
7743
22
198
65
17
49
75
220
7743
23
198
1953
87
16373
86
419
220
7743
24
198
76123
41
75
99217
48
28
220
5120
15
198
41
508
28
220
5120
16
198
56
1682
84
220
5120
17
198
76123
41
75
99217
86
28
220
5120
18
198
40
44265
16
66
31825
7513
77
48
28
220
5120
19
198
12420
88
220
5120
20
198
46521
19
84
43
70
419
220
5120
21
198
76123
41
75
99217
87
325
48
419
220
5120
22
198
30407
53
36068
86
419
220
5120
23
198
1953
84778
56
18
48
28
220
5120
24
198
1953
49
383
48
419
220
5037
15
198
1953
41
17008
38
70
28
220
5037
16
198
68
54
10036
57
86
419
220
5037
17
198
40
44265
75
14606
56
28
220
5037
18
198
5484
57
7513
70
419
220
5037
19
198
40
17526
511
76
53
75
220
5037
20
198
76123
38361
65
48
419
220
5037
21
198
1953
16
75
53436
419
220
5037
22
198
65
17
49
20
220
5037
23
198
2843
39972
81823
74
28
220
5037
24
198
6542
32
28
220
7261
15
198
1953
53
19
66
40818
88
220
7261
16
198
67
38
24
84
220
7261
17
198
1953
53
71
56
17
70
28
220
7261
18
198
99217
11805
63643
419
220
7261
19
198
1953
2822
57
48
419
220
7261
20
198
6399
88
57
48
419
220
7261
21
198
64
54
20
17704
86
419
220
7261
22
198
76123
41
17704
32
419
220
7261
23
198
8673
74
28
220
7261
24
198
57
17
66
28
220
8190
15
198
64
54
87
9258
54
24
84
220
8190
16
198
1953
10470
65
18
52
28
220
8190
17
198
67
53921
75
220
8190
18
198
64
75833
28
220
8190
19
198
53
17
52
28
220
8190
20
198
57
17
53
15
220
8190
21
198
49
26376
28
220
8190
22
198
1953
16
509
32
419
220
8190
23
198
40
44265
383
53437
28
220
8190
24
198
65
18
70
28
220
8011
15
198
1953
49
16
66
1029
84
57
86
419
220
8011
16
198
81823
63704
220
8011
17
198
64
55
501
53436
419
220
8011
18
198
56
55
41
75
53436
419
220
8011
19
198
1953
57
50139
48
419
220
8011
20
198
64
38019
50139
38
87
20
220
8011
21
198
1953
20990
66
17455
28
220
8011
22
198
5484
96605
220
8011
23
198
1953
2822
56
84214
28
220
8011
24
198
65
54
97179
220
7322
15
198
14170
53
664
32
419
220
7322
16
198
1953
8910
30407
93697
220
7322
17
198
64
54
53
664
32
419
220
7322
18
198
66
38
25299
220
7322
19
198
64
54
53
15
220
7322
20
198
6358
53
664
32
419
220
7322
21
198
44
2505
28
220
7322
22
198
14170
53
89
220
7322
23
198
66
17526
17063
1187
28
220
7322
24
198
33372
86
220
8027
15
198
57
76
24
85407
33231
15
64
54
24
84
220
8027
16
198
6399
7513
70
419
220
8027
17
198
1953
24
76
57
1029
73
220
8027
18
198
64
54
52837
53436
419
220
8027
19
198
40
17526
85
40924
419
220
8027
20
198
64
55
45
17063
1187
28
220
8027
21
198
1953
10036
57
70
419
220
8027
22
198
2843
78
28
220
8027
23
198
67
38
18442
220
8027
24
198
65
17
37
74
220
8546
15
198
40
31825
16
56
18577
79
56
86
419
220
8546
16
198
76123
1383
65
17
66
28
220
8546
17
198
66
1029
73
220
8546
18
198
42
822
28
220
8546
19
198
76123
31721
28546
419
220
8546
20
198
40
31825
17008
17
93697
220
8546
21
198
67
1029
509
86
419
220
8546
22
198
1953
57
509
86
419
220
8546
23
198
1953
87
85
56
86
419
220
8546
24
198
1953
62830
57
76
57
75
6358
53
664
32
419
220
8899
15
198
40
44265
15
56
53921
75
220
8899
16
198
1953
18442
99217
48
28
220
8899
17
198
41
17
19072
220
8899
18
198
40
31825
7513
18
44
28
220
8899
19
198
40
44265
15
56
55
48
28
220
8899
20
198
6358
53
15
220
8899
21
198
99217
1135
63643
419
220
8899
22
198
40
62859
50139
32
419
220
8899
23
198
1953
75
36068
86
419
220
8899
24
198
6399
82
57
48
419
220
9079
15
198
64
55
57
75
14606
44
28
220
9079
16
198
99217
20
73
220
9079
17
198
1953
53
19
66
38
86
28
220
9079
18
198
1953
37
392
18
39972
81823
40
28
220
9079
19
198
40777
28
220
9079
20
198
1953
37
17
220
9079
21
198
67
38
71
17063
13183
28
220
9079
22
198
30407
45
75
220
9079
23
198
53
17
70
28
220
9079
24
198
1953
2822
64
54
87
74
220
4364
15
198
40
44265
17063
76
45
75
220
4364
16
198
64
55
41
75
53436
419
220
4364
17
198
65
40818
36068
86
419
220
4364
18
198
1953
36825
57
76
52
28
220
4364
19
198
1953
49
509
76
53
17319
18
32
28
220
4364
20
198
64
53921
15
65
55795
28
220
4364
21
198
1953
49
17704
32
419
220
4364
22
198
40
31825
39152
18
44
28
220
4364
23
198
2096
44
28
220
4364
24
198
40
17526
16
6358
19
28
220
7994
15
198
65
18
63704
220
7994
16
198
47741
71
4080
86
419
220
7994
17
198
56
76
53
3418
86
419
220
7994
18
198
6358
24
36068
86
419
220
7994
19
198
5484
37
74
220
7994
20
198
1953
57
88
220
7994
21
198
76123
41
17704
18
32
28
220
7994
22
198
40
44265
75
56
1682
84
53436
419
220
7994
23
198
65
17
70
28
220
7994
24
198
1341
23
28
220
8259
15
198
1953
61348
17
44
28
220
8259
16
198
39364
28
220
8259
17
198
40
44265
43505
54
53
15
64
38
10036
57
86
419
220
8259
18
198
6399
43505
60372
82
57
48
419
220
8259
19
198
1953
97179
220
8259
20
198
1953
57
17063
32
419
220
8259
21
198
1953
16
85
11328
39972
220
8259
22
198
56
63862
28
220
8259
23
198
67
15565
28
220
8259
24
198
1953
38361
14170
93697
30407
16
75
11328
48
28
220
4513
15
198
76123
9996
67
38
71
17008
55
48
28
220
4513
16
198
1953
25299
57
86
419
220
4513
17
198
1953
61348
18
48
28
220
4513
18
198
40
31825
16
67
32
419
220
4513
19
198
40
50816
16
81823
45
15
220
4513
20
198
99217
20
84
220
4513
21
198
76123
1383
65
18
48
28
220
4513
22
198
44
73
32
28
220
4513
23
198
1953
20
509
76
93697
220
4513
24
198
64
54
88242
56
17
52
28
220
8874
15
198
1953
87
509
76
52837
220
8874
16
198
1953
37
41221
32
419
220
8874
17
198
40
17526
20103
54
20
1031
86
419
220
8874
18
198
1953
16
79
57
17
71
15
220
8874
19
198
1953
89224
57
76
53
44490
32
419
220
8874
20
198
6399
85
11328
49
88
40924
419
220
8874
21
198
6399
75
11328
48
28
220
8874
22
198
12420
19
220
8874
23
198
1953
37
17319
38
6365
220
8874
24
198
1953
41
21807
38
657
220
6549
15
198
56
17
71
43505
17
86
28
220
6549
16
198
65
18
49
15
220
6549
17
198
1953
10036
56
18
41
75
220
6549
18
198
1953
57
75
82856
86
28
220
6549
19
198
76123
41
17704
18
53
13752
32
419
220
6549
20
198
1953
87
17008
32
419
220
6549
21
198
1953
57
16
12498
419
220
6549
22
198
65
18
49
75
220
6549
23
198
40
17526
20
220
6549
24
198
81823
41
17704
18
48
28
220
9390
15
198
6399
85
11328
62830
12498
419
220
9390
16
198
76123
53
4458
54
20
77
220
9390
17
198
1953
41
79
57
86
419
220
9390
18
198
44
73
38942
220
9390
19
198
1953
37
89
675
419
220
9390
20
198
1953
41
17704
18
48
28
220
9390
21
198
1341
74
28
220
9390
22
198
60882
19
28
220
9390
23
198
1953
24
24990
32
419
220
9390
24
198
44
89
32
28
220
6804
15
198
1953
3971
65
54
41
17704
70
419
220
6804
16
198
64
54
20
17704
18
44
28
220
6804
17
198
52
18
48
28
220
6804
18
198
65
40818
39152
17
52
28
220
6804
19
198
6399
71
220
6804
20
198
1953
806
66
18
48
28
220
6804
21
198
1953
61348
76
53
44490
32
419
220
6804
22
198
1953
5469
220
6804
23
198
926
86
28
220
6804
24
198
1953
24
86
82856
19
28
220
4386
15
198
40
31825
7513
18
48
28
220
4386
16
198
6399
43505
54
52
28
220
4386
17
198
40
44265
75
82856
15
28
220
4386
18
198
65
18
41
4657
54
20
77
220
4386
19
198
76123
8910
57
75833
28
220
4386
20
198
56
53921
21807
39
74
28
220
4386
21
198
64
53921
50139
32
419
220
4386
22
198
1953
52837
220
4386
23
198
6358
657
30407
48
28
220
4386
24
198
1953
84778
28546
419
220
9748
15
198
40
17526
88
56
48
419
220
9748
16
198
64
54
20
50139
32
419
220
9748
17
198
76123
1383
64
48
419
220
9748
18
198
2843
21089
220
9748
19
198
40
31825
82
56
38019
75
220
9748
20
198
1953
57
85
6358
15
28
220
9748
21
198
40
17526
43505
38
48
28
220
9748
22
198
40
7453
28
220
9748
23
198
99217
75
1791
86
419
220
9748
24
198
56
53921
16
6358
52
28
220
5894
15
198
2843
49
41221
54
16
86
220
5894
16
198
40
44265
15
99217
20
74
220
5894
17
198
1341
44
28
220
5894
18
198
64
18408
17704
70
419
220
5894
19
198
5484
57
88
220
5894
20
198
1953
20
273
90719
28
220
5894
21
198
40
44265
85
56
86
419
220
5894
22
198
40
31825
16
28546
419
220
5894
23
198
1953
87
509
32
419
220
5894
24
198
1953
87
15720
17526
82
57
48
419
220
9263
15
198
1953
71
16
65
48
419
220
9263
16
198
1953
74
28
220
9263
17
198
6358
24
84
220
9263
18
198
8673
52
28
220
9263
19
198
12420
16
220
9263
20
198
6399
43505
54
806
12498
419
220
9263
21
198
1953
16
71
29811
28
220
9263
22
198
2843
39972
81823
41
75
220
9263
23
198
76123
10470
220
9263
24
198
2843
39972
56
55
48
28
220
9413
15
198
1953
10036
57
76
24
85407
33231
15
64
54
24
84
220
9413
16
198
67
17
37
20
63643
419
220
9413
17
198
1953
41
16
63643
419
220
9413
18
198
56
60372
86
220
9413
19
198
1953
75
664
76
53
49755
32
419
220
9413
20
198
65
54
52
28
220
9413
21
198
1953
20990
6358
48
28
220
9413
22
198
99217
10036
82856
48
28
220
9413
23
198
57
33231
74
220
9413
24
198
1953
4937
66
38
24
41221
32
419
220
9423
15
198
1953
37
24990
39
41
85
220
9423
16
198
40
17526
17704
18
48
28
220
9423
17
198
40
17526
7911
48
419
220
9423
18
198
76123
41
17704
18
48
28
220
9423
19
198
65
18
45
75
53436
419
220
9423
20
198
1953
57
16
65
38
86
28
220
9423
21
198
6399
71
6358
52
28
220
9423
22
198
2843
45
86
220
9423
23
198
6399
39152
17
52
28
220
9423
24
198
51
2371
28
220
9565
15
198
40
44265
81
220
9565
16
198
1953
87
17704
18
44
28
220
9565
17
198
1341
82
28
220
9565
18
198
40
31825
71
14606
62830
56
86
419
220
9565
19
198
2843
75307
220
9565
20
198
99217
41
325
48
419
220
9565
21
198
67
38019
81
220
9565
22
198
64
55
2822
82856
48
28
220
9565
23
198
56
17
17156
220
9565
24
198
56
76
52
28
220
8878
15
198
1953
87
4080
18
48
28
220
8878
16
198
56
53921
7513
70
419
220
8878
17
198
40
17526
7513
32
419
220
8878
18
198
1953
37
74
36238
419
220
8878
19
198
5484
41
75
220
8878
20
198
14606
53
44490
32
419
220
8878
21
198
1953
49
21807
48
419
220
8878
22
198
6358
37
15
64
54
24
84
220
8878
23
198
65
38
10036
57
86
419
220
8878
24
198
57
18
74
28
220
9795
15
198
6358
53
75
12498
419
220
9795
16
198
57
17
93697
220
9795
17
198
1953
71
43505
54
52
28
220
9795
18
198
1953
25299
57
77
48
28
220
9795
19
198
1953
41
509
17526
17704
70
419
220
9795
20
198
1953
49
16373
11010
28
220
9795
21
198
926
849
220
9795
22
198
1953
37
15
67
37432
75092
419
220
9795
23
198
76123
1383
65
17
31580
57
48
419
220
9795
24
198
65
38
10036
57
48
419
220
10148
15
198
56
55
41
32478
86
419
220
10148
16
198
1953
41
4355
32
419
220
10148
17
198
6358
49400
220
10148
18
198
5484
71
17008
86
419
220
10148
19
198
2843
2822
57
48
419
220
10148
20
198
56
55
41
77
57
48
419
220
10148
21
198
1341
15
83
220
10148
22
198
82196
23
85
220
10148
23
198
1953
41
88
40924
419
220
10148
24
198
2843
1255
220
10350
15
198
56
53921
89
220
10350
16
198
1953
41
16
64
54
87
74
220
10350
17
198
67
18
66
28
220
10350
18
198
64
18408
75
53436
419
220
10350
19
198
99217
4937
220
10350
20
198
56
55
45
17704
86
419
220
10350
21
198
82856
20
3841
48
419
220
10350
22
198
1953
16
4317
54
19
28
220
10350
23
198
64
54
20
75
53436
419
220
10350
24
198
1953
10036
56
17
87
16
57
38
10036
57
86
419
220
10125
15
198
76123
82
28
220
10125
16
198
1953
67
17008
32
419
220
10125
17
198
1953
75
664
40818
88
81823
45
15
220
10125
18
198
1953
11805
57
60550
28
220
10125
19
198
2843
70
28
220
10125
20
198
1953
53
39152
86
419
220
10125
21
198
99217
28723
54
20
77
220
10125
22
198
6399
82
56
55
45
89
220
10125
23
198
19
78
34
76
220
10125
24
198
5484
20
85
220
6860
15
198
40
62859
71
28546
419
220
6860
16
198
40
44265
83
99217
19072
220
6860
17
198
99217
16
20824
55795
28
220
6860
18
198
48
53
48
28
220
6860
19
198
1953
42848
57
48
419
220
6860
20
198
2843
45
85
220
6860
21
198
76123
41
75
56
17
52
28
220
6860
22
198
40
31825
43505
32641
15
220
6860
23
198
1953
16
17008
70
419
220
6860
24
198
40
31825
82
99217
19
28
220
9335
15
198
76123
5028
6358
45
75
11328
48
28
220
9335
16
198
64
55
57
17063
13183
28
220
9335
17
198
6399
50139
60550
28
220
9335
18
198
40
31825
383
48
419
220
9335
19
198
8673
48
28
220
9335
20
198
66
17
44
28
220
9335
21
198
64
55
45
75
53436
419
220
9335
22
198
76123
53
664
32
419
220
9335
23
198
65
914
273
48
419
220
9335
24
198
66
38
87
588
48
419
220
10239
15
198
2898
2545
47
48
419
220
10239
16
198
1953
62830
57
38
19
28
220
10239
17
198
5484
10036
53436
419
220
10239
18
198
82856
94055
220
10239
19
198
81823
41
15
99217
10036
220
10239
20
198
40
31825
7513
86
419
220
10239
21
198
55
777
69
55
86
419
220
10239
22
198
64
55
57
17704
70
419
220
10239
23
198
76123
1383
65
17
45
17704
18
44
28
220
10239
24
198
76123
1383
65
17
10470
99217
15
28
220
10290
15
198
64
54
57
79
82856
48
28
220
10290
16
198
2843
41
17704
32
419
220
10290
17
198
8673
56
28
220
10290
18
198
67
55
41
85
220
10290
19
198
65
17
87
85
57
18
74
28
220
10290
20
198
56
53921
15
81823
40
28
220
10290
21
198
64
54
20
71
220
10290
22
198
1953
20
50139
54
52
28
220
10290
23
198
5484
37
17319
32
419
220
10290
24
198
1953
57
17008
84214
28
220
8929
15
198
76123
41
509
79296
88
12498
419
220
8929
16
198
67
1029
17008
53437
28
220
8929
17
198
56
77
44
28
220
8929
18
198
6399
50139
38
25299
53436
419
220
8929
19
198
1953
16
85
14170
52
28
220
8929
20
198
2843
45
73
220
8929
21
198
64
55
41
74
220
8929
22
198
1953
10470
65
18
53
86
220
8929
23
198
1953
41
88
57
48
419
220
8929
24
198
1953
16
75
12498
419
220
9591
15
198
6399
39152
32
419
220
9591
16
198
67
40818
84
220
9591
17
198
82856
52
28
220
9591
18
198
1953
49
7911
48
419
220
9591
19
198
65
40818
77
220
9591
20
198
64
40818
88
57
48
419
220
9591
21
198
67
55
14804
18
40
28
220
9591
22
198
40
31825
16373
32
419
220
9591
23
198
6399
16
14606
41
75
11328
48
28
220
9591
24
198
64
18408
17704
86
419
220
10465
15
198
40
31825
7513
32
419
220
10465
16
198
67
38
23
28
220
10465
17
198
82856
1135
64
54
24
84
220
10465
18
198
1953
37
13752
17
37
20
63643
419
220
10465
19
198
1953
16
17063
32
419
220
10465
20
198
76123
38361
65
54
88242
220
10465
21
198
12420
17
220
10465
22
198
1953
24
82
53436
419
220
10465
23
198
64
55
57
75
12498
419
220
10465
24
198
6358
37
10196
32
419
220
10288
15
198
5484
24
88
220
10288
16
198
6358
24
88
220
10288
17
198
82856
1135
65
39
74
28
220
10288
18
198
1953
20
75
56
84214
28
220
10288
19
198
5484
53
19
220
10288
20
198
6358
53
50139
48
419
220
10288
21
198
66
17
70
28
220
10288
22
198
12420
15
220
10288
23
198
1953
57
88
82856
52
28
220
10288
24
198
64
55
45
4458
54
24
84
220
10410
15
198
66
18
73262
30407
48
28
220
10410
16
198
40
965
85
12498
419
220
10410
17
198
99217
87
15720
39
74
28
220
10410
18
198
67
55
45
75
53436
419
220
10410
19
198
8673
44
28
220
10410
20
198
1953
49
17704
17
2312
12498
419
220
10410
21
198
1953
2822
99217
20
77
57
48
419
220
10410
22
198
1953
2822
99217
20
77
220
10410
23
198
1953
41
85
220
10410
24
198
40
62859
4080
86
419
220
10161
15
198
82856
16
72
81823
40
28
220
10161
16
198
1953
41
43505
17
82
28
220
10161
17
198
6358
53
71
97011
74
28
220
10161
18
198
1953
796
65
38
86
28
220
10161
19
198
44
73
52
28
220
10161
20
198
66
39
5028
53436
419
220
10161
21
198
1953
37
18
56
55
74
28
220
10161
22
198
1953
37
581
55795
28
220
10161
23
198
6399
17008
54
1135
14606
74
28
220
10161
24
198
6399
85
11328
45
15
220
3965
15
198
56
55
63704
220
3965
16
198
1953
24
88
57
40818
88
220
3965
17
198
48
26376
28
220
3965
18
198
64
54
24
88
220
3965
19
198
64
55
53
83
220
3965
20
198
65
18
41
15
64
32
419
220
3965
21
198
8673
70
28
220
3965
22
198
99217
4835
99217
31580
57
48
419
220
3965
23
198
40
44265
18
220
3965
24
198
1953
16
17063
38
87
17063
1187
28
220
9690
15
198
12420
89
220
9690
16
198
56
53921
79
56
86
419
220
9690
17
198
67
40818
74
220
9690
18
198
40
2782
85
220
9690
19
198
1953
24
86
81823
40
28
220
9690
20
198
82856
20
77
220
9690
21
198
40
17526
20103
54
20
77
220
9690
22
198
99217
79
7513
70
419
220
9690
23
198
56
1682
392
508
28
220
9690
24
198
40
965
43505
54
15
28
220
9756
15
198
76123
3055
68
48
419
220
9756
16
198
67
55
41
75
53436
419
220
9756
17
198
67
55
41
50139
32
419
220
9756
18
198
40
44265
5697
38
24
43505
32
419
220
9756
19
198
56
50536
28
220
9756
20
198
5484
16
71
28546
419
220
9756
21
198
1953
37
76
57
70
419
220
9756
22
198
1953
49
383
53437
28
220
9756
23
198
1953
37
392
70
419
220
9756
24
198
67
55
2822
220
9800
15
198
99217
20
75
220
9800
16
198
17268
56
28
220
9800
17
198
82856
66
28
220
9800
18
198
76123
1383
65
17
56
28
220
9800
19
198
1953
18442
99217
87
15
64
32
419
220
9800
20
198
65
18
53
15
64
32
419
220
9800
21
198
48
77
53
15
220
9800
22
198
64
54
24
84
99217
86
28
220
9800
23
198
43
38181
28
220
9800
24
198
40
44265
43505
32
419
220
10559
15
198
1953
37
2445
76
53
71
97011
74
28
220
10559
16
198
926
44
86
220
10559
17
198
1953
2822
56
55
41
71
56
18
48
28
220
10559
18
198
7939
52
28
220
10559
19
198
1953
57
7911
54
88242
53436
419
220
10559
20
198
49
11435
28
220
10559
21
198
64
33231
1791
86
419
220
10559
22
198
64
38019
82
57
48
419
220
10559
23
198
41
17
48
28
220
10559
24
198
5484
24
84
220
9992
15
198
1953
25299
56
55
45
15
220
9992
16
198
76123
1383
65
508
28
220
9992
17
198
1953
49
88
220
9992
18
198
1953
71
4080
18
48
28
220
9992
19
198
64
55
39972
81823
40
28
220
9992
20
198
1953
53
49755
32
419
220
9992
21
198
64
67238
16
220
9992
22
198
8673
66
28
220
9992
23
198
66
1682
84
220
9992
24
198
40
17526
21807
38
86
28
220
10132
15
198
40
17526
50139
82252
28
220
10132
16
198
65
17
17156
220
10132
17
198
65
17
75
664
32
419
220
10132
18
198
65
40818
44490
38
22580
12498
419
220
10132
19
198
5876
19
28
220
10132
20
198
76123
53
664
38
4835
220
10132
21
198
56
55
53
3458
32
419
220
10132
22
198
1953
87
16373
40818
88
220
10132
23
198
40
62859
75
220
10132
24
198
40
62859
79
81823
66
28
220
10895
15
198
82856
20
4657
54
20
77
220
10895
16
198
64
55
57
75
53436
419
220
10895
17
198
76123
38361
6358
48
28
220
10895
18
198
67
17
37
88
57
48
419
220
10895
19
198
6399
7513
18
48
28
220
10895
20
198
1953
53
392
18
53
3458
32
419
220
10895
21
198
1953
9996
14170
52
28
220
10895
22
198
2843
53
4381
53921
75
53436
419
220
10895
23
198
40
17526
75
56
17
17156
220
10895
24
198
56
55
41
75
11328
48
28
220
11286
15
198
51
16
40
28
220
11286
16
198
40
31825
71
28546
419
220
11286
17
198
16688
88
220
11286
18
198
33372
86
8673
56
28
220
11286
19
198
66
1029
49755
32
419
220
11286
20
198
81823
41
17063
13183
28
220
11286
21
198
1829
40
28
220
11286
22
198
1953
87
71
8883
75
220
11286
23
198
66
17
42848
57
48
419
220
11286
24
198
56
38019
20
220
11068
15
198
56
17
45
17704
18
44
28
220
11068
16
198
76123
9996
12498
419
220
11068
17
198
1953
4937
66
38
24
41221
37432
664
32
419
220
11068
18
198
12420
20
46
48
419
220
11068
19
198
1953
49
85
81823
61435
220
11068
20
198
12420
18
220
11068
21
198
1953
41
16
66
17
10036
81823
45
89
220
11068
22
198
6399
82
57
33231
88
220
11068
23
198
76123
41
17704
17
52
28
220
11068
24
198
40
38181
28
220
6330
15
198
67
55
41
20
220
6330
16
198
1953
53
9902
48
419
220
6330
17
198
56
55
45
15
81823
40
28
220
6330
18
198
99217
56871
220
6330
19
198
5484
37
83
81823
41
79
56
17
77845
220
6330
20
198
30407
53
44490
32
419
220
6330
21
198
1953
53
19
66
40818
44490
32
419
220
6330
22
198
64
55
57
75
14606
45
15720
39
74
28
220
6330
23
198
1953
24
73
56
86
419
220
6330
24
198
5484
57
82
220
10718
15
198
1953
796
30407
48
28
220
10718
16
198
1953
16
75
99217
19
28
220
10718
17
198
40
31825
39152
18
48
28
220
10718
18
198
1953
49
509
70
419
